<!DOCTYPE html>
<html>
<head>
	<title>GUI-Stile f&uuml;r Controls</title>
	<meta charset="utf-8">
	<link href="../css/default.css" rel="stylesheet">
	<style type="text/css">
	th.c2 {width:9%}
	 th.c1 {width:22%}
	</style>
</head>
<body>
	<h1>GUI-Stile f&uuml;r Controls</h1><br>
	<p>Diese Seite enth&auml;lt eine Liste der gew&ouml;hnlichen und erweiterten Stile, die auf Fenster angewendet werden k&ouml;nnen und auch besondere Stile, welche mit Controls verwendet werden k&ouml;nnen. Diese Stile werden im "style"- und/oder "exStyle"-Parameter vieler GUI-Funktionen benutzt. Um diese Stile zu verwenden, ist das korrekte <b><font color="#800000">#include</font></b> im Script anzugeben.</p>
	<p><a id="Top"></a><a href="#Extended">Extended</a> | <a href="#Avi">Avi</a> | <a href="#Button">Button</a> | <a href="#Checkbox">Checkbox</a> | <a href="#Combo">Combo</a> | <a href="#Date">Date</a> | <a href="#Edit">Edit/Input</a> | <a href="#Label">Label/Static</a> | <a href="#ListBox">ListBox</a> | <a href="#ListView">ListView</a> | <a href="#ListViewExtended">ListView Extended</a> | <a href="#MonthCal">MonthCal</a> | <a href="#Progress">Progress</a> | <a href="#Slider">Slider</a> | <a href="#Tab">Tab</a> | <a href="#TreeView">TreeView</a> | <a href="#UpDown">UpDown</a></p>
	<p><strong>Zu beachten ist folgendes:</strong> "Interner Wert" ist nur als Referenz angegeben. Man sollte immer den "Konstantenbezeichner" des Stiles angeben, damit das Script lesbar bleibt.</p>
	<p><br></p>
	<table>
		<tr>
			<th class="c1">Konstanten f&uuml;r allgemeine Stile</th>
			<th class="c2">Interner Wert</th>
			<th>Beschreibung</th>
		</tr>
		<tr>
			<td>&nbsp;</td>
			<td>&nbsp;</td>
			<td>
				<p class="center">#include &lt;WindowsConstants.au3&gt;</p>
			</td>
		</tr>
		<tr>
			<td>Standard/erzwungen f&uuml;r die GUI-Erstellung</td>
			<td></td>
			<td>
				$GUI_SS_DEFAULT_GUI siehe <a href="../functions/GUICreate.htm">GUICreate</a> function.
			</td>
		</tr>
		<tr>
			<td>$WS_BORDER</td>
			<td>0x00800000</td>
			<td>Erstellt ein Fenster mit einer d&uuml;nnen Umrandung.</td>
		</tr>
		<tr>
			<td>$WS_POPUP</td>
			<td>0x80000000</td>
			<td>Erzeugt ein Pop-up-Fenster. Dieser Stil kann nicht gemeinsam mit dem Stil WS_CHILD verwendet werden.</td>
		</tr>
		<tr>
			<td>$WS_CAPTION</td>
			<td>0x00C00000</td>
			<td>Erzeugt ein Fenster mit einer Titelleiste (schlie&szlig;t den Stil WS_BORDER mit ein).</td>
		</tr>
		<tr>
			<td>$WS_CLIPCHILDREN</td>
			<td>0x02000000</td>
			<td>Wird das "parent"-Fenster neu gezeichnet, bleibt die Fl&auml;che, die von "child"-Fenstern &uuml;berdeckt wird, ausgeschlossen. Dieser Stil wird verwendet, wenn das "parent"-Fenster erzeugt wird. Kann auch verwendet werden, wenn die GUI beim gr&ouml;&szlig;erziehen flackert.</td>
		</tr>
		<tr>
			<td>$WS_CLIPSIBLINGS</td>
			<td>0x04000000</td>
			<td>Schneidet "child"-Fensterfl&auml;chen bei sich gegenseitig &uuml;berlappenden "child"-Fenstern aus; das hei&szlig;t, wenn ein bestimmtes "child"-Fenster eine WM_PAINT-Nachricht erh&auml;lt, schneidet der Stil WS_CLIPSIBLINGS zun&auml;chst alle Fl&auml;chen aus dieser Fensterfl&auml;che aus, die durch andere "child"-Fenster verdeckt werden, bevor der Inhalt der Fl&auml;che neu gezeichnet wird. Ist WS_CLIPSIBLINGS nicht angegeben und "child"-Fenster &uuml;berlagern sich, kann es sein, dass beim Zeichnen innerhalb der einen "child"-Fensterfl&auml;che auch in die Fl&auml;che des benachbarten Fensters hineingezeichnet wird. Kann auch verwendet werden, wenn die GUI beim gr&ouml;&szlig;erziehen flackert.</td>
		</tr>
		<tr>
			<td>$WS_DISABLED</td>
			<td>0x08000000</td>
			<td>Erzeugt ein Fenster, das von Anfang an inaktiv ist.</td>
		</tr>
		<tr>
			<td>$WS_DLGFRAME</td>
			<td>0x00400000</td>
			<td>Erzeugt ein Fenster, dessen Rand wie bei typischen Dialogfenstern aussieht.</td>
		</tr>
		<tr>
			<td>$WS_HSCROLL</td>
			<td>0x00100000</td>
			<td>Erzeugt ein Fenster mit horizontalem Scroll-Balken.</td>
		</tr>
		<tr>
			<td>$WS_MAXIMIZE</td>
			<td>0x01000000</td>
			<td>Erzeugt ein Fenster, das von Anfang an maximiert angezeigt wird (den ganzen Bildschirm ausf&uuml;llend).</td>
		</tr>
		<tr>
			<td>$WS_MAXIMIZEBOX</td>
			<td>0x00010000</td>
			<td>Erzeugt ein Fenster mit einer Maximieren-Schaltfl&auml;che. Zus&auml;tzlich muss der Stil WS_SYSMENU angegeben werden. Dieser Stil kann nicht mit dem Stil WS_EX_CONTEXTHELP kombiniert werden. Durch diesen Stil &uuml;berdeckt das erzeugte Fenster die Taskleiste nicht.</td>
		</tr>
		<tr>
			<td>$WS_MINIMIZE</td>
			<td>0x20000000</td>
			<td>Erzeugt ein Fenster, das von Anfang an minimiert wird (nur als Symbol auf der Taskleiste).</td>
		</tr>
		<tr>
			<td>$WS_MINIMIZEBOX</td>
			<td>0x00020000</td>
			<td>Erzeugt ein Fenster mit einer Minimieren-Schaltfl&auml;che. Zus&auml;tzlich muss der Stil WS_SYSMENU angegeben werden. Dieser Stil kann nicht mit dem Stil WS_EX_CONTEXTHELP kombiniert werden.</td>
		</tr>
		<tr>
			<td>$WS_OVERLAPPED</td>
			<td>0x00000000</td>
			<td>Erzeugt ein &uuml;berlagertes Fenster. Ein &uuml;berlagertes Fenster hat eine Titelleiste und einen Rahmen. Vergleichbar mit dem Stil WS_TILED.</td>
		</tr>
		<tr>
			<td>$WS_OVERLAPPEDWINDOW</td>
			<td>0x00CF0000</td>
			<td>Erzeugt ein &uuml;berlagertes Fenster mit den Stilen WS_OVERLAPPED, WS_CAPTION, WS_SYSMENU, WS_THICKFRAME, WS_MINIMIZEBOX und WS_MAXIMIZEBOX. Vergleichbar mit dem Stil WS_TILEDWINDOW.</td>
		</tr>
		<tr>
			<td>$WS_POPUPWINDOW</td>
			<td>0x80880000</td>
			<td>Erzeugt ein Pop-up-Fenster mit den Stilen WS_BORDER, WS_POPUP und WS_SYSMENU. Die Stile WS_CAPTION und WS_POPUPWINDOW m&uuml;ssen kombiniert werden, um das Men&uuml; des Fensters sichtbar zu machen.</td>
		</tr>
		<tr>
			<td>$WS_SIZEBOX</td>
			<td>0x00040000</td>
			<td>Erzeugt ein Fenster mit einem gr&ouml;&szlig;enver&auml;nderlichen Rahmen. Vergleichbar mit dem Stil WS_THICKFRAME.</td>
		</tr>
		<tr>
			<td>$WS_SYSMENU</td>
			<td>0x00080000</td>
			<td>Erzeugt ein Fenster, das ein Fenster-Men&uuml; auf seiner Titelleiste hat. Zus&auml;tzlich muss der Stil WS_CAPTION angegeben werden.</td>
		</tr>
		<tr>
			<td>$WS_THICKFRAME</td>
			<td>0x00040000</td>
			<td>Erzeugt ein Fenster mit einem gr&ouml;&szlig;enver&auml;nderlichen Rahmen. Vergleichbar mit dem Stil WS_SIZEBOX.</td>
		</tr>
		<tr>
			<td>$WS_VSCROLL</td>
			<td>0x00200000</td>
			<td>Erzeugt ein Fenster mit einem vertikalen Scroll-Balken.</td>
		</tr>
		<tr>
			<td>$WS_VISIBLE</td>
			<td>0x10000000</td>
			<td>Erzeugt ein Fenster, das von Anfang an sichtbar ist.</td>
		</tr>
		<tr>
			<td>$WS_CHILD</td>
			<td>0x40000000</td>
			<td>Erzeugt ein "child"-Fenster. Ein Fenster mit diesem Stil kann keine Men&uuml;leiste haben. Dieser Stil kann nicht mit dem Stil WS_POPUP kombiniert werden.</td>
		</tr>
		<tr>
			<td>$WS_GROUP</td>
			<td>0x00020000</td>
			<td>Erzeugt das erste Control einer Control-Gruppe. Die Gruppe besteht aus diesem ersten Element und allen anschlie&szlig;end definierten Controls, bis wieder ein Control mit dem Stil WS_GROUP definiert wird.</td>
		</tr>
		<tr>
			<td>$WS_TABSTOP</td>
			<td>0x00010000</td>
			<td>Verwandelt das Control in einen Tabulator, so dass der Nutzer das Control anw&auml;hlen kann, indem er mit der Tabulatortaste von einem Element der Dialogbox zum n&auml;chsten springt.</td>
		</tr>
		<tr>
			<td>$DS_MODALFRAME</td>
			<td>0x00000080</td>
			<td>Erzeugt ein Dialogfenster mit einem "modalen" Dialogfenster-Rahmen, der mit einer Titelleiste und einem <strong>Fenster</strong>-Men&uuml; kombiniert werden kann, welche mit den Stilen WS_CAPTION und WS_SYSMENU definiert werden. "Modal" bedeutet, dass man mit darunter liegenden Fenstern erst weiterarbeiten kann, nachdem dieses modale Fenster geschlossen wurde (typisch f&uuml;r Dialogfenster mit Fehlermeldungen oder &auml;hnlichem).</td>
		</tr>
		<tr>
			<td>$DS_SETFOREGROUND</td>
			<td>0x00000200</td>
			<td>Erzwingt, dass das aufgerufene Fenster als vorderstes Fenster angezeigt wird. Dieser Stil ist n&uuml;tzlich f&uuml;r "modale" Dialogboxen, die die sofortige Aufmerksamkeit des Nutzers ben&ouml;tigten, unabh&auml;ngig davon, ob das erzeugende Fenster im Vordergrund angezeigt wird oder nicht.</td>
		</tr>
		<tr>
			<td>$DS_CONTEXTHELP</td>
			<td>0x00002000</td>
			<td>Zeigt ein Fragezeichen in der Titelleiste des Dialogfensters an. Dieser Stil kann nicht mit den Stilen WS_MAXIMIZEBOX oder WS_MINIMIZEBOX kombiniert werden. Vergleichbar mit dem erweiterten Stil WS_EX_CONTEXTHELP.</td>
		</tr>
	</table>
	<p>&nbsp;</p>
	<p>&nbsp;</p>
	<table>
		<tr>
			<th class="c1">
				<a id="Extended"></a>Konstanten f&uuml;r normale erweiterte Stile
			</th>
						<th class="c2">Interner Wert</th>
						<th>Beschreibung</th>
		</tr>
		<tr>
			<td>
				<a href="#Top">Top</a>
			</td>
			<td>&nbsp;</td>
			<td>
				<p class="center">#include &lt;WindowsConstants.au3&gt;</p>
			</td>
		</tr>
		<tr>
			<td>$WS_EX_ACCEPTFILES</td>
			<td>0x00000010</td>
			<td>
				Erlaubt einem Texteingabefeld (edit oder input control) innerhalb des erzeugten GUI-Fensters, Dateinamen per drag & drop zu empfangen. Das Eingabefeld muss zus&auml;tzlich den Status $GUI_ACCEPTFILES besitzen, der mit <a href="../functions/GUICtrlSetState.htm">GUICtrlSetState</a> gesetzt wird.
			</td>
		</tr>
		<tr>
			<td>$WS_EX_APPWINDOW</td>
			<td>0x00040000</td>
			<td>Erzwingt ein Top-Level-Fenster auf der Taskleiste, wenn das Fenster sichtbar ist.</td>
		</tr>
		<tr>
			<td>$WS_EX_COMPOSITED</td>
			<td>0x02000000</td>
			<td>Zeichnet alle Nachfahren eines Fensters von unten nach oben mit double-buffering.</td>
		</tr>
		<tr>
			<td>$WS_EX_CLIENTEDGE</td>
			<td>0x00000200</td>
			<td>Legt fest, dass ein Fenster einen Rahmen mit abgesenkten Kanten hat.</td>
		</tr>
		<tr>
			<td>$WS_EX_CONTEXTHELP</td>
			<td>0x00000400</td>
			<td>Bindet ein Fragezeichen in die Titelleiste des Fensters ein. Kann nicht zusammen mit den Stilen WS_MAXIMIZEBOX oder WS_MINIMIZEBOX verwendet werden.</td>
		</tr>
		<tr>
			<td>$WS_EX_DLGMODALFRAME</td>
			<td>0x00000001</td>
			<td>Erzeugt ein Fenster mit einem doppelten Rahmen; das Fenster kann - optional - mit einer Titelleiste erzeugt werden, indem der Stil WS_CAPTION als dwStyle-Parameter gesetzt wird.</td>
		</tr>
		<tr>
			<td>$WS_EX_LAYOUTRTL</td>
			<td>0x400000</td>
			<td>Legt fest, dass ein Fenster das Layout von rechts nach links (RTL) anstelle standardm&auml;&szlig;ig links nach rechts hat (LTR).</td>
		</tr>
		<tr>
			<td>$WS_EX_MDICHILD</td>
			<td>0x00000040</td>
			<td>Erstellt ein child-Fenster, welches sich beim verschieben des Parent-Fensters genauso mitverschiebt (Simulation eines MDI-Fensters; maximieren/minimieren sind nicht nachgemacht).</td>
		</tr>
		<tr>
			<td>$WS_EX_OVERLAPPEDWINDOW</td>
			<td>0x00000300</td>
			<td>Kombination aus den Stilen WS_EX_CLIENTEDGE und WS_EX_WINDOWEDGE.</td>
		</tr>
		<tr>
			<td>$WS_EX_STATICEDGE</td>
			<td>0x00020000</td>
			<td>Erstellt ein Fenster mit einem 3D-Rahmen-Stil, das f&uuml;r Felder gedacht ist, die keine Eintr&auml;ge vom Nutzer akzeptieren.</td>
		</tr>
		<tr>
			<td>$WS_EX_TOPMOST</td>
			<td>0x00000008</td>
			<td>Legt fest, dass ein Fenster, das mit diesem Stil erzeugt wird, vor allen anderen (non-topmost) Fenstern platziert wird und dort bleibt, selbst wenn das Fenster deaktiviert wird.</td>
		</tr>
		<tr>
			<td>$WS_EX_TRANSPARENT</td>
			<td>0x00000020</td>
			<td>Das Fenster erscheint transparent, wenn die &uuml;berlagerten Teile von darunterliegenden Fenstern schon gezeichnet wurden.</td>
		</tr>
		<tr>
			<td>$WS_EX_TOOLWINDOW</td>
			<td>0x00000080</td>
			<td>Erzeugt ein Toolbar-Fenster (tool window); also ein Fenster, das als schwebende Symbolleiste verwendet werden soll. Eine Toolbar hat eine Titelleiste, die k&uuml;rzer ist als normale Titelleisten, und der Fenstertitel wird mit einer kleineren Schrift angezeigt. Eine Toolbar erscheint nicht in der Taskleiste oder im Dialogfeld, das erscheint, wenn der Nutzer die Tastenkombination ALT+TAB dr&uuml;ckt. Wenn ein solches Fenster ein System-Men&uuml; hat, wird kein Icon daf&uuml;r auf der Titelleiste angezeigt. Das System-Men&uuml; l&auml;sst sich aber mit ALT+SPACE sichtbar machen.</td>
		</tr>
		<tr>
			<td>$WS_EX_WINDOWEDGE</td>
			<td>0x00000100</td>
			<td>Legt fest, dass ein Fenster einen Rahmen mit erh&ouml;hter Kante hat.</td>
		</tr>
		<tr>
			<td>$WS_EX_LAYERED</td>
			<td>0x00080000</td>
			<td>Erstellt ein Fenster mit mehreren Schichten. Es ist zu beachten, dass dieser Stil nicht f&uuml;r „child“-Fenster verwendet werden kann.</td>
		</tr>
		<tr>
			<td>$GUI_WS_EX_PARENTDRAG</td>
			<td>0x00100000</td>
			<td>Erlaubt es dem Label- oder Bild-Control, wie eine Titelleiste angesehen zu werden, um das ganze „parent“-Fenster zu ziehen. (Ben&ouml;tigt #include &lt;GUIConstantsEx.au3&gt;)</td>
		</tr>
	</table>
	<p>&nbsp;</p>
	<p>&nbsp;</p>
	<table>
		<tr>
			<th class="c1">
				<a id="CheckBox"></a>Konstanten f&uuml;r Checkbox-Stile
			</th>
						<th class="c2">Interner Wert</th>
						<th>Beschreibung</th>
		</tr>
		<tr>
			<td>
				<a href="#Top">Top</a>
			</td>
			<td>&nbsp;</td>
			<td>
								<p class="center">#include &lt;ButtonConstants.au3&gt;</p>
			</td>
		</tr>
		<tr>
			<td>Standard/erzwungen</td>
			<td></td>
			<td>
				siehe <a href="../functions/GUICtrlCreateCheckbox.htm">GUICtrlCreateCheckbox</a> Funktion.
			</td>
		</tr>
		<tr>
			<td>$BS_3STATE</td>
			<td>0x0005</td>
			<td>Erzeugt eine Checkbox, das markiert, leer oder nicht verf&uuml;gbar sein kann. Benutze die "Nicht verf&uuml;gbar"-Option, um anzuzeigen, dass der Status der Checkbox nicht festgelegt ist.</td>
		</tr>
		<tr>
			<td>$BS_AUTO3STATE</td>
			<td>0x0006</td>
			<td>Erzeugt eine Checkbox mit 3 Zust&auml;nden, in dem der Status zwischen markiert, nicht verf&uuml;gbar und leer jedes Mal durchwechselt, wenn der Benutzer das K&auml;stchen anw&auml;hlt.</td>
		</tr>
		<tr>
			<td>$BS_AUTOCHECKBOX</td>
			<td>0x0003</td>
			<td>Erzeugt eine Checkbox, in dem der Status jedes Mal zwischen markiert und leer wechselt, wenn der Benutzer das K&auml;stchen anw&auml;hlt.</td>
		</tr>
		<tr>
			<td>$BS_CHECKBOX</td>
			<td>0x0002</td>
			<td>Erzeugt eine kleine, leere Checkbox mit einer Beschriftung, die rechts vom K&auml;stchen angezeigt wird. Um den Text links vom K&auml;stchen anzuzeigen, verwende zus&auml;tzlich den Stil BS_RIGHTBUTTON.</td>
		</tr>
		<tr>
			<td>$BS_LEFT</td>
			<td>0x0100</td>
			<td>Setzt den Text linksb&uuml;ndig im rechteckigen Label rechts von der Checkbox.</td>
		</tr>
		<tr>
			<td>$BS_PUSHLIKE</td>
			<td>0x1000</td>
			<td>L&auml;sst die Schaltfl&auml;che ("check box", "three-state check box" oder "radio button") wie einen Schalter aussehen und agieren. Der Knopf schaut aus der Fl&auml;che heraus, wenn er nicht gedr&uuml;ckt oder markiert wurde, wirkt andererseits wie in die Fl&auml;che hineingedr&uuml;ckt, wenn er angeklickt oder markiert wurde.</td>
		</tr>
		<tr>
			<td>$BS_RIGHT</td>
			<td>0x0200</td>
			<td>Setzt den Text rechtsb&uuml;ndig im rechteckigen Beschriftungsfeld rechts von der Checkbox.</td>
		</tr>
		<tr>
			<td>$BS_RIGHTBUTTON</td>
			<td>0x0020</td>
			<td>Positioniert die Checkbox rechts von dem zugeh&ouml;rigen Label.</td>
		</tr>
		<tr>
			<td>$BS_GROUPBOX</td>
			<td>0x0007</td>
			<td>Erstellt ein Rechteck, in dem andere Buttons gruppiert werden k&ouml;nnen. Ein beliebiger Text, welcher mit diesem Stil verbunden ist, wird in der oberen linken Ecke des Rechtecks platziert.</td>
		</tr>
		<tr>
			<td>$BS_AUTORADIOBUTTON</td>
			<td>0x0009</td>
			<td>Das gleiche wie ein Radiobutton. Reagiert bei Auswahl durch den Benutzer, so dass der Button automatisch hervorgehoben wird und die Markierung von jedem anderen Radiobutton mit demselben Stil in der selben Gruppe entfernt wird.</td>
		</tr>
	</table>
	<p>&nbsp;</p>
	<p>&nbsp;</p>
	<table>
		<tr>
			<th class="c1">
				<a id="Button"></a>Konstanten f&uuml;r Schaltfl&auml;chen-Stile
			</th>
						<th class="c2">Interner Wert</th>
						<th>Beschreibung</th>
		</tr>
		<tr>
			<td>
				<a href="#Top">Top</a>
			</td>
			<td>&nbsp;</td>
			<td>
				<p class="center">#include &lt;ButtonConstants.au3&gt;</p>
			</td>
		</tr>
		<tr>
			<td>Standard/erzwungen</td>
			<td></td>
			<td>
				siehe <a href="../functions/GUICtrlCreateButton.htm">GUICtrlCreateButton</a>, <a href="../functions/GUICtrlCreateCheckbox.htm">GUICtrlCreateCheckbox</a> und <a href="../functions/GUICtrlCreateRadio.htm">GUICtrlCreateRadio</a> Funktionen.
			</td>
		</tr>
		<tr>
			<td>$BS_BOTTOM</td>
			<td>0x0800</td>
			<td>Platziert den Text am unteren Rand des Schaltfl&auml;chen-Rechtecks.</td>
		</tr>
		<tr>
			<td>$BS_CENTER</td>
			<td>0x0300</td>
			<td>Zentriert den Text horizontal im Schaltfl&auml;chen-Rechteck.</td>
		</tr>
		<tr>
			<td>$BS_DEFPUSHBUTTON</td>
			<td>0x0001</td>
			<td>Erzeugt eine Schaltfl&auml;che mit einem dicken, schwarzen Rand (Default-Schaltfl&auml;che). Wenn der Button sich in einer Dialogbox befindet, kann er die Schaltfl&auml;che &uuml;ber die ENTER-Taste (Return-Taste) ausw&auml;hlen, selbst wenn die Schaltfl&auml;che keinen Eingabe-Fokus hat. Dieser Stil ist n&uuml;tzlich, um dem Nutzer zu erm&ouml;glichen, die wahrscheinlichste Option oder den Standardwert schnell auszuw&auml;hlen.</td>
		</tr>
		<tr>
			<td>$BS_MULTILINE</td>
			<td>0x2000</td>
			<td>Bricht den Schaltfl&auml;chen-Text in mehrere Zeilen um, wenn die Text-Zeichenkette zu lang ist, um einzeilig ins Schaltfl&auml;chen-Rechteck zu passen.</td>
		</tr>
		<tr>
			<td>$BS_TOP</td>
			<td>0x0400</td>
			<td>Platziert den Text am oberen Rand des Schaltfl&auml;chen-Rechtecks.</td>
		</tr>
		<tr>
			<td>$BS_VCENTER</td>
			<td>0x0C00</td>
			<td>Zentriert den Text vertikal im Schaltfl&auml;chen-Rechteck.</td>
		</tr>
		<tr>
			<td>$BS_ICON</td>
			<td>0x0040</td>
			<td>Legt fest, dass die Schaltfl&auml;che ein Icon anzeigt.</td>
		</tr>
		<tr>
			<td>$BS_BITMAP</td>
			<td>0x0080</td>
			<td>Legt fest, dass die Schaltfl&auml;che eine Bitmap-Grafik anzeigt.</td>
		</tr>
		<tr>
			<td>$BS_FLAT</td>
			<td>0x8000</td>
			<td>Legt fest, dass die Schaltfl&auml;che 2-dimensional angezeigt wird; die &uuml;bliche Schattierung f&uuml;r den 3D-Eindruck wird nicht verwendet.</td>
		</tr>
		<tr>
			<td>$BS_NOTIFY</td>
			<td>0x4000</td>
			<td>Versetzt einen Button in die Lage, eine BN_KILLFOCUS und BN_SETFOCUS Benachrichtigung an dessen „parent“-Fenster zu senden. Es ist zu beachten, dass Buttons die Benachrichtigung BN_CLICKED senden, egal ob er diesen Stil besitzt oder nicht. Um die BN_DBLCLK Benachrichtigung zu erhalten, muss der Button auch den Stil BS_RADIOBUTTON oder BS_OWNERDRAW besitzen.</td>
		</tr>
	</table>
	<p>&nbsp;</p>
	<p>&nbsp;</p>
	<table>
		<tr>
			<th class="c1">
				<a id="Combo"></a>Konstanten f&uuml;r Combo-Stile
			</th>
						<th class="c2">Interner Wert</th>
						<th>Beschreibung</th>
		</tr>
		<tr>
			<td>
				<a href="#Top">Top</a>
			</td>
			<td>&nbsp;</td>
			<td>
				<p class="center">#include &lt;ComboConstants.au3&gt;</p>
			</td>
		</tr>
		<tr>
		<tr>
			<td>Standard/erzwungen</td>
			<td></td>
			<td>
				$GUI_SS_DEFAULT_COMBO siehe <a href="../functions/GUICtrlCreateCombo.htm">GUICtrlCreateCombo</a> Funktion.
			</td>
		</tr>
		<tr>
			<td>$CBS_AUTOHSCROLL</td>
			<td>0x0040</td>
			<td>Scrollt den Text in einem Textfeld automatisch nach rechts, wenn der Nutzer ein Zeichen am Zeilenende eingibt. Wenn dieser Stil nicht gesetzt ist, wird nur Text angezeigt, der in den rechteckigen Rahmen des Feldes passt.</td>
		</tr>
		<tr>
			<td>$CBS_DISABLENOSCROLL</td>
			<td>0x0800</td>
			<td>Zeigt auch dann eine inaktive vertikale Scroll-Leiste in der Auswahl-Box der Liste an, wenn in der Box nicht genug Eintr&auml;ge enthalten sind, um zu scrollen. Ohne diesen Stil wird bei zu wenigen Eintr&auml;gen keine Scroll-Leiste angezeigt.</td>
		</tr>
		<tr>
			<td>$CBS_DROPDOWN</td>
			<td>0x0002</td>
			<td>Zeigt als Standard nur das Texteingabefeld an. Der Nutzer kann die Liste anzeigen lassen, indem er auf das Pfeilsymbol neben dem Eingabefeld klickt.</td>
		</tr>
		<tr>
			<td>$CBS_DROPDOWNLIST</td>
			<td>0x0003</td>
			<td>Zeigt ein statisches Textfeld an, das den aktuell ausgew&auml;hlten Eintrag aus der Liste anzeigt. Au&szlig;erdem werden manuelle Eingaben verhindert.</td>
		</tr>
		<tr>
			<td>$CBS_LOWERCASE</td>
			<td>0x4000</td>
			<td>Wandelt den gesamten Text in Kleinbuchstaben um, sowohl im Auswahlfeld als auch in der Liste der Combo-Box.</td>
		</tr>
		<tr>
			<td>$CBS_NOINTEGRALHEIGHT</td>
			<td>0x0400</td>
			<td>Legt fest, dass die Combo-Box genau die Gr&ouml;&szlig;e beibeh&auml;lt, die beim Erzeugen der Combo-Box festgelegt wurde. &Uuml;blicherweise wird eine Combo-Box von Windows CE so dimensioniert, dass Eintr&auml;ge komplett angezeigt werden.</td>
		</tr>
		<tr>
			<td>$CBS_OEMCONVERT</td>
			<td>0x0080</td>
			<td>Wandelt eingetippten Text im Combo-Box-Eingabefeld vom Windows CE-Zeichensatz in den OEM-Zeichensatz um, und dann wieder in den Windows CE-Zeichensatz zur&uuml;ck. Dieser Stil ist sehr n&uuml;tzlich f&uuml;r Combo-Boxen, die Dateinamen enthalten. Er ist nur auf Combo-Boxen anwendbar, die mit dem CBS_DROPDOWN Stil erzeugt wurden.</td>
		</tr>
		<tr>
			<td>$CBS_SIMPLE</td>
			<td>0x0001</td>
			<td>Zeigt die Auswahlliste immer an. Die aktuelle Markierung in dieser Liste wird im Eingabefeld angezeigt.</td>
		</tr>
		<tr>
			<td>$CBS_SORT</td>
			<td>0x0100</td>
			<td>Sortiert Zeichenketten, die in die Liste eingegeben werden.</td>
		</tr>
		<tr>
			<td>$CBS_UPPERCASE</td>
			<td>0x2000</td>
			<td>Wandelt den gesamten Text sowohl im Auswahlfeld als auch in der Liste der Combo-Box in Gro&szlig;buchstaben um.</td>
		</tr>
		</table>
	<p>&nbsp;</p>
	<p>&nbsp;</p>
	<table>
		<tr>
			<th class="c1">
				<a id="Listbox"></a>Konstanten f&uuml;r Listen-Stile
			</th>
						<th class="c2">Interner Wert</th>
						<th>Beschreibung</th>
		</tr>
		<tr>
			<td>
				<a href="#Top">Top</a>
			</td>
			<td>&nbsp;</td>
			<td>
				<p class="center">#include &lt;ListBoxConstants.au3&gt;</p>
			</td>
		</tr>
		<tr>
			<td>Standard/erzwungen</td>
			<td></td>
			<td>
				$GUI_SS_DEFAULT_LIST siehe <a href="../functions/GUICtrlCreateList.htm">GUICtrlCreateList</a> Funktion.
			</td>
		</tr>
		<tr>
			<td>$LBS_DISABLENOSCROLL</td>
			<td>0x1000</td>
			<td>Zeigt einen inaktiven vertikalen Scrollbalken f&uuml;r die ListBox an, wenn diese Liste zu wenige Eintr&auml;ge zum scrollen hat. Wenn man diesen Stil nicht einsetzt, wird der Scrollbalken versteckt, falls die Liste zu wenige Eintr&auml;ge hat.</td>
		</tr>
		<tr>
			<td>$LBS_NOINTEGRALHEIGHT</td>
			<td>0x0100</td>
			<td>Legt fest, dass die ausklappbare ListBox in genau der Gr&ouml;&szlig;e angezeigt wird, die beim Erzeugen der Liste festgelegt wurde.</td>
		</tr>
		<tr>
			<td>$LBS_NOSEL</td>
			<td>0x4000</td>
			<td>Legt fest, dass der Benutzer die Eintr&auml;ge der Liste betrachten, aber nicht ausw&auml;hlen kann.</td>
		</tr>
		<tr>
			<td>$LBS_NOTIFY</td>
			<td>0x0001</td>
			<td>Benachrichtigt das "parent"-Fenster, wenn der Benutzer einen Eintrag in der Liste anklickt oder darauf doppelklickt.</td>
		</tr>
		<tr>
			<td>$LBS_SORT</td>
			<td>0x0002</td>
			<td>Sortiert Eintr&auml;ge in der Liste alphabetisch.</td>
		</tr>
		<tr>
			<td>$LBS_STANDARD</td>
			<td>0xA00003</td>
			<td>Sortiert Eintr&auml;ge in der Liste alphabetisch. Das "parent"-Fenster erh&auml;lt eine Eingabe-Benachrichtigung, wenn der Benutzer einen Eintrag in der Liste anklickt oder darauf doppelklickt. Die ausklappbare ListBox hat einen Rahmen an allen Seiten. (LBS_NOTIFY | LBS_SORT |WS_VSCROLL | WS_BORDER)</td>
		</tr>
		<tr>
			<td>$LBS_USETABSTOPS</td>
			<td>0x0080</td>
			<td>Erm&ouml;glicht es einer Liste, Tabulatorzeichen zu erkennen und in Leerraum umzusetzen, wenn die Eintr&auml;ge angezeigt werden. Die Standard-Tabulatorposition ist bei 32 Dialogbox-Einheiten. Eine Dialogbox-Einheit entspricht einem Viertel der aktuellen Dialogbox-Basis-Einheit f&uuml;r die Breite.</td>
		</tr>
		</table>
	<p>&nbsp;</p>
	<p>&nbsp;</p>
	<table>
		<tr>
			<th class="c1">
				<a id="Edit"></a>Konstanten f&uuml;r Edit/Input-Stile
			</th>
						<th class="c2">Interner Wert</th>
						<th>Beschreibung</th>
		</tr>
		<tr>
			<td>
				<a href="#Top">Top</a>
			</td>
			<td>&nbsp;</td>
			<td>
				<p class="center">#include &lt;EditConstants.au3&gt;</p>
			</td>
		</tr>
		<tr>
			<td>Standard/erzwungen</td>
			<td></td>
			<td>
				$GUI_SS_DEFAULT_EDIT, $GUI_SS_DEFAULT_INPUT siehe <a href="../functions/GUICtrlCreateEdit.htm">GUICtrlCreateEdit</a> oder <a href="../functions/GUICtrlCreateInput.htm">GUICtrlCreateInput</a> Funktion.
			</td>
		</tr>
		<tr>
			<td>$ES_AUTOHSCROLL</td>
			<td>0x0080</td>
			<td>Scrollt automatisch den Text um 10 Zeichen nach links, wenn der Nutzer ein Zeichen am Ende der Zeile eingibt. Wenn der Nutzer die ENTER-Taste (Return-Taste) dr&uuml;ckt, wird der Text wieder auf die Nullposition zur&uuml;ckgescrollt.</td>
		</tr>
		<tr>
			<td>$ES_AUTOVSCROLL</td>
			<td>0x0040</td>
			<td>Scrollt den Text eine Seite nach oben, wenn der Nutzer die ENTER-Taste in der letzten Zeile dr&uuml;ckt.</td>
		</tr>
		<tr>
			<td>$ES_CENTER</td>
			<td>0x0001</td>
			<td>Zentriert den Text in einem mehrzeiligen Eingabefeld.</td>
		</tr>
		<tr>
			<td>$ES_LOWERCASE</td>
			<td>0x0010</td>
			<td>Wandelt alle Zeichen in Kleinbuchstaben um, wenn sie in das Textfeld eingegeben werden.</td>
		</tr>
		<tr>
			<td>$ES_NOHIDESEL</td>
			<td>0x0100</td>
			<td>Verhindert das Standardverhalten eines Edit-Controls. Standardm&auml;&szlig;ig wird eine Markierung versteckt, wenn das Element den Eingabefokus verliert und die Markierung wird invertiert, wenn das Element den Eingabefokus erh&auml;lt. Wenn man den ES_NOHIDESEL-Stil verwendet, wird der markierte Text invertiert, auch wenn das Control den Fokus nicht mehr besitzt.</td>
		</tr>
		<tr>
			<td>$ES_NUMBER</td>
			<td>0x2000</td>
			<td>Akzeptiert nur die Eingabe von Zahlen in das Textfeld.</td>
		</tr>
		<tr>
			<td>$ES_OEMCONVERT</td>
			<td>0x0400</td>
			<td>Dieser Stil ist sehr n&uuml;tzlich f&uuml;r Texteingabefelder, die Dateinamen enthalten.</td>
		</tr>
		<tr>
			<td>$ES_MULTILINE</td>
			<td>0x0004</td>
			<td>Erm&ouml;glicht ein mehrzeiliges Texteingabefeld. Standard ist ein einzeiliges Eingabefeld.</td>
		</tr>
		<tr>
			<td>$ES_PASSWORD</td>
			<td>0x0020</td>
			<td>Zeigt f&uuml;r jedes eingegebene Zeichen ein Sternchen (*) an.</td>
		</tr>
		<tr>
			<td>$ES_READONLY</td>
			<td>0x0800</td>
			<td>Verhindert die Eingabe oder Ver&auml;nderung von Text im Eingabefeld durch den Nutzer.</td>
		</tr>
		<tr>
			<td>$ES_RIGHT</td>
			<td>0x0002</td>
			<td>Setzt den Text eines mehrzeiligen Textfeldes rechtsb&uuml;ndig.</td>
		</tr>
		<tr>
			<td>$ES_UPPERCASE</td>
			<td>0x0008</td>
			<td>Wandelt alle Zeichen in Gro&szlig;buchstaben um, w&auml;hrend sie in das Textfeld eingegeben werden.</td>
		</tr>
		<tr>
			<td>$ES_WANTRETURN</td>
			<td>0x1000</td>
			<td>Legt fest, dass ein Zeilenumbruch (CR/LF #13#10) in den Text eingef&uuml;gt wird, wenn der Nutzer die ENTER-Taste benutzt, w&auml;hrend er Text in ein mehrzeiliges Textfeld einer Dialogbox eingibt. Wenn man diesen Stil nicht verwendet, hat das Dr&uuml;cken der ENTER-Taste den gleichen Effekt wie der Klick auf die Standard-Schaltfl&auml;che (z.B. den OK-Button) der Dialogbox. Dieser Stil hat keinen Effekt bei einzeiligen Texteingabefeldern.</td>
		</tr>
	</table>
	<p>&nbsp;</p>
	<p>&nbsp;</p>
	<table>
		<tr>
			<th class="c1">
				<a id="Progress"></a>Konstanten f&uuml;r ProgressBar-Stile
			</th>
						<th class="c2">Interner Wert</th>
						<th>Beschreibung</th>
		</tr>
		<tr>
			<td>
				<a href="#Top">Top</a>
			</td>
			<td>&nbsp;</td>
			<td>
				<p class="center">#include &lt;ProgressConstants.au3&gt;</p>
			</td>
		</tr>
		<tr>
			<td>$PBS_MARQUEE</td>
			<td>0x08</td>
			<td>Stellt den Fortschrittstatus als eine scrollendes "marquee" dar.</td>
		</tr>
		<tr>
			<td>$PBS_SMOOTH</td>
			<td>0x01</td>
			<td>Zeigt den Fortschritt als kontinuierlichen Balken anstatt des standardm&auml;&szlig;ig unterteilten Balkens.</td>
			<strong>Beachte</strong> Dieser Stil wird nur im Windows-Klassik-Thema unterst&uuml;tzt. Alle anderen Themons werden sich unabh&auml;ngig mit oder ohne diesen Stil nicht &auml;ndern.</td>
		</tr>
		<tr>
			<td>$PBS_SMOOTHREVERSE</td>
			<td>0x10</td>
			<td>Zeigt den Forschrittstatus mit einem glatten R&uuml;ckw&auml;rts&uuml;bergang dar, wenn von einem h&ouml;hren in einen niedrigeren Wert gewechselt wird. Standardm&auml;&szlig;ig springt das Control zu dem nierigeren Wert.<br>
			<strong>Note</strong> Dieser Stil wird nur von Windows Vista und neuer unterst&uuml;tzt.</td>
		</tr>
		<tr>
			<td>$PBS_VERTICAL</td>
			<td>0x04</td>
			<td>Zeigt die Progressbar vertikal - von unten nach oben - an.</td>
		</tr>
	</table>
	<p>&nbsp;</p>
	<p>&nbsp;</p>
	<table>
		<tr>
			<th class="c1">
				<a id="UpDown"></a>Konstanten f&uuml;r Up-down Stile
			</th>
						<th class="c2">Interner Wert</th>
									<th>Beschreibung</th>
		</tr>
		<tr>
			<td>
				<a href="#Top">Top</a>
			</td>
			<td>&nbsp;</td>
			<td>
				<p class="center">#include &lt;UpDownConstants.au3&gt;</p>
			</td>
		</tr>
		<tr>
			<td>Standard/erzwungen</td>
			<td></td>
			<td>
				$GUI_SS_DEFAULT_UPDOWN siehe <a href="../functions/GUICtrlCreateUpdown.htm">GUICtrlCreateUpdown</a> Funktion.
			</td>
		</tr>
		<tr>
			<td>$UDS_ALIGNLEFT</td>
			<td>0x08</td>
			<td>Positioniert die Pfeiltasten neben der linken Kante des zugeh&ouml;rigen Textfeldes. Das Textfeld wird nach rechts verschoben und seine Breite verkleinert, um das Up-Down-Control mit aufzunehmen.</td>
		</tr>
		<tr>
			<td>$UDS_ALIGNRIGHT</td>
			<td>0x04</td>
			<td>Positioniert die Pfeiltasten neben der rechten Kante des zugeh&ouml;rigen Textfeldes. Die Breite des Textfelds wird verkleinert, um das Up-Down-Control mit aufzunehmen.</td>
		</tr>
		<tr>
			<td>$UDS_ARROWKEYS</td>
			<td>0x20</td>
			<td>Macht das Up-Down-Control mit den PFEIL-NACH-OBEN- und PFEIL-NACH-UNTEN-Tasten der Tastatur bedienbar.</td>
		</tr>
		<tr>
			<td>$UDS_HORZ</td>
			<td>0x40</td>
			<td>Die Pfeiltasten des Up-Down-Controls zeigen nach links und rechts anstatt nach oben und unten.</td>
		</tr>
		<tr>
			<td>$UDS_NOTHOUSANDS</td>
			<td>0x80</td>
			<td>Verhindert die Eingabe eines Tausender-Trennzeichens in gro&szlig;en Zahlen.</td>
		</tr>
		<tr>
			<td>$UDS_WRAP</td>
			<td>0x01</td>
			<td>Erlaubt ein Umspringen des Wertes, wenn er &uuml;ber den Anfang oder das Ende des Wertebereichs hinaus verkleinert oder vergr&ouml;&szlig;ert wird.</td>
		</tr>
	</table>
	<p>&nbsp;</p>
	<p>&nbsp;</p>
	<table>
		<tr>
			<th class="c1">
				<a id="Label"></a>Konstanten f&uuml;r Label/Static-Stile
			</th>
						<th class="c2">Interner Wert</th>
						<th>Beschreibung</th>
		</tr>
		<tr>
			<td>
				<a href="#Top">Top</a>
			</td>
			<td>&nbsp;</td>
			<td>
				<p class="center">#include &lt;StaticConstants.au3&gt;</p>
			</td>
		</tr>
		<tr>
			<td>Standard/erzwungen</td>
			<td></td>
			<td>
				$GUI_SS_DEFAULT_LABEL, $GUI_SS_DEFAULT_ICON, $GUI_SS_DEFAULT_PIC siehe <a href="../functions/GUICtrlCreateLabel.htm">GUICtrlCreateLabel</a>, <a href="../functions/GUICtrlCreateIcon.htm">GUICtrlCreateIcon</a>, <a href="../functions/GUICtrlCreatePic.htm">GUICtrlCreatePic</a> Funktionen.
			</td>
		</tr>
		<tr>
			<td>$SS_BLACKFRAME</td>
			<td>0x07</td>
			<td>Erzeugt eine Box mit einem Rahmen um das Control in der gleichen Farbe wie der Fenster-Rahmen. Im Standard-Farbenschema ist diese Farbe schwarz. "Frame-Style-Static" Controls zeigen keinen Text.</td>
		</tr>
		<tr>
			<td>$SS_BLACKRECT</td>
			<td>0x04</td>
			<td>Erzeugt ein Rechteck, das mit der aktuellen Fenster-Rahmenfarbe gef&uuml;llt ist. Im Standard-Farbenschema ist diese Farbe schwarz. "Rectangle-Style-Static" Controls zeigen keinen Text.</td>
		</tr>
		<tr>
			<td>$SS_CENTER</td>
			<td>0x01</td>
			<td>Erzeugt ein einfaches Rechteck und zentriert Text der Fehlermeldung (error value text). Das Control bricht automatisch Text am Ende einer Zeile um.</td>
		</tr>
		<tr>
			<td>$SS_CENTERIMAGE</td>
			<td>0x0200</td>
			<td>Legt fest, dass der Mittelpunkt eines static Controls mit dem SS_BITMAP-Stil unver&auml;ndert bleibt, wenn man die Gr&ouml;&szlig;e des Controls &auml;ndert. Die vier Seiten werden so ver&auml;ndert, dass sie passend f&uuml;r ein neues Bild sind. Wenn das Bild kleiner ist als die Fl&auml;che des Controls, wird die restliche Fl&auml;che in der Farbe des Pixels in der linken oberen Ecke des Bildes ausgef&uuml;llt. Der Stil kann mit static Controls verwendet werden, die nur <strong>eine</strong> Zeile Text enthalten. Der Text wird vertikal zentriert</td>
      			Dieser Stil f&uuml;hrt nicht dazu, dass unbenutzte Teile des Controls mit der Farbe des oberen linken Pixels der Bitmap oder des Symbols gef&uuml;llt werden. Nicht verwendete Teile des Controle behalten die Hintergrundfarbe.</td>
		</tr>
		<tr>
			<td>$SS_ETCHEDFRAME</td>
			<td>0x12</td>
			<td>Zeichnet den Rahmen des static Controls im EDGE_ETCHED Kanten-Stil. "Frame-Style-Static" Controls zeigen keinen Text.</td>
		</tr>
		<tr>
			<td>$SS_ETCHEDHORZ</td>
			<td>0x10</td>
			<td>Zeichnet die Ober- und Unterkante des static Controls im EDGE_ETCHED Kanten-Stil. "Frame-Style-Static" Controls zeigen keinen Text.</td>
		</tr>
		<tr>
			<td>$SS_ETCHEDVERT</td>
			<td>0x11</td>
			<td>Zeichnet die linke und rechte Kante des static Controls im EDGE_ETCHED Kanten-Stil. "Frame-Style-Static" Controls zeigen keinen Text.</td>
		</tr>
		<tr>
			<td>$SS_GRAYFRAME</td>
			<td>0x08</td>
			<td>Erzeugt eine Box mit einem Rahmen in der gleichen Farbe wie der Bildschirm-Hintergrund (desktop). Im Standard-Farbschema ist diese Farbe grau. "Frame-Style-Static" Controls zeigen keinen Text.</td>
		</tr>
		<tr>
			<td>$SS_GRAYRECT</td>
			<td>0x05</td>
			<td>Erzeugt ein Rechteck, das mit der aktuellen Bildschirm-Hintergrundfarbe gef&uuml;llt ist. Im Standard-Farbschema ist diese Farbe grau. "Rectangle-Style-Static" Controls zeigen keinen Text.</td>
		</tr>
		<tr>
			<td>$SS_LEFT</td>
			<td>0x0000</td>
			<td>Erzeugt ein einfaches Rechteck und setzt den Text im Rechteck linksb&uuml;ndig. Der Text wird formatiert, bevor er angezeigt wird. Worte, die &uuml;ber das Zeilenende hinausgehen, werden automatisch in die n&auml;chste Zeile linksb&uuml;ndig umgebrochen. Worte, die l&auml;nger sind als die Control-Breite, werden getrennt.</td>
		</tr>
		<tr>
			<td>$SS_LEFTNOWORDWRAP</td>
			<td>0x0C</td>
			<td>Erzeugt ein einfaches Rechteck und setzt den Text im Rechteck linksb&uuml;ndig. Tabulatoren werden als Leerraum angezeigt, aber der Text wird nicht umgebrochen. Text, der &uuml;ber das Zeilenende hinausgeht, wird abgeschnitten.</td>
		</tr>
		<tr>
			<td>$SS_NOPREFIX</td>
			<td>0x80</td>
			<td>Verhindert die Interpretation von "&"-Zeichen im Text des Controls als Sonderzeichen (accelerator prefix characters). Der SS_NOPREFIX-Stil kann mit anderen Stilen kombiniert werden, indem man den bitweisen OR (|)-Operator (bitweises Oder) verwendet. Das kann n&uuml;tzlich sein, wenn Dateinamen oder andere Zeichenketten, die das &-Zeichen enthalten, in einem static Control in einer Dialogbox angezeigt werden m&uuml;ssen.</td>
		</tr>
		<tr>
			<td>$SS_NOTIFY</td>
			<td>0x0100</td>
			<td>Sendet die STN_CLICKED-Benachrichtigung an das "parent"-Fenster, wenn der Nutzer auf das Control klickt.</td>
		</tr>
		<tr>
			<td>$SS_RIGHT</td>
			<td>0x0002</td>
			<td>Erzeugt ein Rechteck und setzt den angegebenen Text im Rechteck rechtsb&uuml;ndig.</td>
		</tr>
		<tr>
			<td>$SS_RIGHTJUST</td>
			<td>0x0400</td>
			<td>Legt fest, dass die untere rechte Ecke eines static Controls mit dem SS_BITMAP oder SS_ICON-Stil unver&auml;ndert bleibt, wenn die Gr&ouml;&szlig;e des Controls ver&auml;ndert wird. Nur die obere und linke Seite werden ver&auml;ndert, um das Control an eine neue Bitmap-Grafik oder ein neues Icon anzupassen.</td>
		</tr>
		<tr>
			<td>$SS_SIMPLE</td>
			<td>0x0B</td>
			<td>Erzeugt ein einfaches Rechteck und zeigt einen einzeiligen Text linksb&uuml;ndig im Rechteck an. Die Textzeile kann nicht gek&uuml;rzt oder in irgendeiner Weise ver&auml;ndert werden. Au&szlig;erdem wird der Text nicht wie sonst &uuml;blich grau, wenn das Control inaktiv wird.</td>
		</tr>
		<tr>
			<td>$SS_SUNKEN</td>
			<td>0x1000</td>
			<td>Zeichnet einen halb-abgesenkten Rahmen um ein static Control.</td>
		</tr>
		<tr>
			<td>$SS_WHITEFRAME</td>
			<td>0x09</td>
			<td>Erzeugt eine Box mit einem Rahmen in der gleichen Farbe wie der Fensterhintergrund. Im Standard-Farbschema ist diese Farbe wei&szlig;. "Frame-Style-Static" Controls zeigen keinen Text.</td>
		</tr>
		<tr>
			<td>$SS_WHITERECT</td>
			<td>0x06</td>
			<td>Erzeugt ein Rechteck, das in der Farbe des aktuellen Fensterhintergrunds gef&uuml;llt ist. Im Standard-Farbschema ist diese Farbe wei&szlig;. "Rectangle-Style-Static" Controls zeigen keinen Text.</td>
		</tr>
		</table>
	<p>&nbsp;</p>
	<p>&nbsp;</p>
	<table>
		<tr>
			<th class="c1">
				<a id="Tab"></a>Konstanten f&uuml;r Tab Stile
			</th>
						<th class="c2">Interner Wert</th>
						<th>Beschreibung</th>
		</tr>
		<tr>
			<td>
				<a href="#Top">Top</a>
			</td>
			<td>&nbsp;</td>
			<td>
				<p class="center">#include &lt;TabConstants.au3&gt;</p>
			</td>
		</tr>
		<tr>
			<td>Standard/erzwungen</td>
			<td></td>
			<td>
				siehe <a href="../functions/GUICtrlCreateTab.htm">GUICtrlCreateTab</a> Funktion.
			</td>
		</tr>
		<tr>
			<td>$TCS_SCROLLOPPOSITE</td>
			<td>0x0001</td>
			<td>Nicht benutzte Registerkarten werden auf die gegen&uuml;berliegende Seite des Controls verschoben, wenn eine Registerkarte ausgew&auml;hlt wird.</td>
		</tr>
		<tr>
			<td>$TCS_BOTTOM</td>
			<td>0x0002</td>
			<td>Die Kartenreiter erscheinen am unteren Rand des Controls. Dieser Wert ist gleich TCS_RIGHT. Dieser Stil wird nicht unterst&uuml;tzt, wenn man Version 6 der Datei comCtl32.dll verwendet.</td>
		</tr>
		<tr>
			<td>$TCS_RIGHT</td>
			<td>0x0002</td>
			<td>Die Kartenreiter erscheinen vertikal an der rechten Seite des Controls, das den TCS_VERTICAL-Stil benutzt. Dieser Wert entspricht TCS_BOTTOM.</td>
		</tr>
		<tr>
			<td>$TCS_MULTISELECT</td>
			<td>0x0004</td>
			<td>Mehrere Registerkarten k&ouml;nnen ausgew&auml;hlt werden, wenn beim Klicken die <small>CTRL-Taste</small> (Strg-Taste) gedr&uuml;ckt wird. Dieser Stil muss zusammen mit dem TCS_BUTTONS-Stil verwendet werden.</td>
		</tr>
		<tr>
			<td>$TCS_FLATBUTTONS</td>
			<td>0x0008</td>
			<td>Ausgew&auml;hlte Kartenreiter sehen aus, als ob sie in den Hintergrund hineingedr&uuml;ckt w&auml;ren, w&auml;hrend die anderen Kartenreiter auf der gleichen Ebene wie der Hintergrund erscheinen. Dieser Stil beeinflusst die tab-Controls nur zusammen mit dem TCS_BUTTONS-Stil.</td>
		</tr>
		<tr>
			<td>$TCS_FORCEICONLEFT</td>
			<td>0x0010</td>
			<td>Icons werden b&uuml;ndig an die linke Kante jedes Tabs gesetzt, das eine festgelegte Breite hat. Dieser Stil kann nur zusammen mit dem TCS_FIXEDWIDTH-Stil benutzt werden.</td>
		</tr>
		<tr>
			<td>$TCS_FORCELABELLEFT</td>
			<td>0x0020</td>
			<td>Beschriftungen (label) werden b&uuml;ndig mit der linken Kante jedes Tabs dargestellt; das hei&szlig;t, die Beschriftung wird anstatt zentriert direkt rechts vom Icon gesetzt. Dieser Stil kann nur zusammen mit dem TCS_FIXEDWIDTH-Stil benutzt werden, und er beinhaltet den TCS_FORCEICONLEFT-Stil.</td>
		</tr>
		<tr>
			<td>$TCS_HOTTRACK</td>
			<td>0x0040</td>
			<td>Eintr&auml;ge unter dem Mauszeiger werden automatisch hervorgehoben.</td>
		</tr>
		<tr>
			<td>$TCS_VERTICAL</td>
			<td>0x0080</td>
			<td>Die Kartenreiter erscheinen am linken Rand des Controls, ihr Text wird vertikal angezeigt. Dieser Stil ist nur zusammen mit dem TCS_MULTILINE-Stil einsetzbar. Um die Kartenreiter auf der rechten Seite des Controls anzuzeigen, ist zus&auml;tzlich der TCS_RIGHT-Stil n&ouml;tig. Dieser Stil wird nicht unterst&uuml;tzt, wenn man Version 6 der Datei comctl32.dll verwendet.</td>
		</tr>
		<tr>
			<td>$TCS_TABS</td>
			<td>0x0000</td>
			<td>Kartenreiter werden als Kartenreiter angezeigt, und ein Rahmen wird um die Anzeigefl&auml;che des Controls gezeichnet. Dies ist der Standard-Stil.</td>
		</tr>
		<tr>
			<td>$TCS_BUTTONS</td>
			<td>0x0100</td>
			<td>Kartenreiter erscheinen als Schaltfl&auml;chen (buttons), und es wird kein Rahmen um die Anzeigefl&auml;che des Controls gezeichnet.</td>
		</tr>
		<tr>
			<td>$TCS_SINGLELINE</td>
			<td>0x0000</td>
			<td>Nur eine Zeile von Kartenreitern wird angezeigt. Der Nutzer kann bei Bedarf scrollen, um weitere Kartenreiter zu sehen. Dieser Stil wird standardm&auml;&szlig;ig verwendet.</td>
		</tr>
		<tr>
			<td>$TCS_MULTILINE</td>
			<td>0x0200</td>
			<td>Bei Bedarf werden mehrere Zeilen von Kartenreitern angezeigt, so dass alle Kartenreiter auf einmal zu sehen sind.</td>
		</tr>
		<tr>
			<td>$TCS_RIGHTJUSTIFY</td>
			<td>0x0000</td>
			<td>Die Breite jedes Kartenreiters wird bei Bedarf vergr&ouml;&szlig;ert, so dass jede Zeile von Kartenreitern die ganze Breite des Tab-Controls ausf&uuml;llt. Dieser Stil wird ignoriert, wenn nicht auch der TCS_MULTILINE-Stil verwendet wird.</td>
		</tr>
		<tr>
			<td>$TCS_FIXEDWIDTH</td>
			<td>0x0400</td>
			<td>Alle Kartenreiter haben die gleiche Breite. Dieser Stil kann nicht mit dem TCS_RIGHTJUSTIFY-Stil kombiniert werden.</td>
		</tr>
		<tr>
			<td>$TCS_RAGGEDRIGHT</td>
			<td>0x0800</td>
			<td>Kartenreiter-Zeilen werden nicht gedehnt, damit sie die ganze Breite des Tab-Controls ausf&uuml;llen. Dieser Stil wird standardm&auml;&szlig;ig verwendet.</td>
		</tr>
		<tr>
			<td>$TCS_FOCUSONBUTTONDOWN</td>
			<td>0x1000</td>
			<td>Das Tab-Control erh&auml;lt den Eingabefokus, wenn darauf geklickt wird.</td>
		</tr>
		<tr>
			<td>$TCS_OWNERDRAWFIXED</td>
			<td>0x2000</td>
			<td>Das "parent"-Fenster ist f&uuml;r das Zeichnen der Kartenreiter zust&auml;ndig.</td>
		</tr>
		<tr>
			<td>$TCS_TOOLTIPS</td>
			<td>0x4000</td>
			<td>Mit dem Tab-Control ist ein Tooltip-Control verbunden.</td>
		</tr>
		<tr>
			<td>$TCS_FOCUSNEVER</td>
			<td>0x8000</td>
			<td>Das Tab-Control erh&auml;lt den Eingabefokus nicht, wenn darauf geklickt wird.</td>
		</tr>
	</table>
	<p>&nbsp;</p>
	<p>&nbsp;</p>
	<table>
		<tr>
			<th class="c1">
				<a id="Avi"></a>Konstanten f&uuml;r AviClip-Stile
			</th>
						<th class="c2">Interner Wert</th>
						<th>Beschreibung</th>
		</tr>
		<tr>
			<td>
				<a href="#Top">Top</a>
			</td>
			<td>&nbsp;</td>
			<td>
				<p class="center">#include &lt;AVIConstants.au3&gt;</p>
			</td>
		</tr>
		<tr>
			<td>Standard/erzwungen</td>
			<td></td>
			<td>
				$GUI_SS_DEFAULT_AVI siehe <a href="../functions/GUICtrlCreateAvi.htm">GUICtrlCreateAvi</a> Funktion.
			</td>
		</tr>
		<tr>
			<td>$ACS_AUTOPLAY</td>
			<td>0x04</td>
			<td>Beginnt mit dem Abspielen des Videos, sobald der AVI-Clip ge&ouml;ffnet wird.</td>
		</tr>
		<tr>
			<td>$ACS_CENTER</td>
			<td>0x01</td>
			<td>Zentriert das Video im Control-Fenster.</td>
		</tr>
		<tr>
			<td>$ACS_TRANSPARENT</td>
			<td>0x02</td>
			<td>Erlaubt es, die Hintergrundfarbe des Anzeigefensters an die Farbe des darunterliegenden Fensters anzupassen, so dass der Hintergrund "transparent" wird. (Standardwert)</td>
		</tr>
		<tr>
			<td>$ACS_NONTRANSPARENT</td>
			<td>0x10</td>
			<td>Zum &Uuml;berschreiben des standardm&auml;&szlig;igen ACS_TRANSPARENT.</td>
		</tr>
	</table>
	<p>&nbsp;</p>
	<p>&nbsp;</p>
	<table>
		<tr>
			<th class="c1">
				<a id="Date"></a>Konstanten f&uuml;r Zeit/Datum-Stile
			</th>
						<th class="c2">Interner Wert</th>
						<th>Beschreibung</th>
		</tr>
		<tr>
			<td>
				<a href="#Top">Top</a>
			</td>
			<td>&nbsp;</td>
			<td>
				<p class="center">#include &lt;DateTimeConstants.au3&gt;</p>
			</td>
		</tr>
		<tr>
			<td>Standard/erzwungen</td>
			<td></td>
			<td>
				$GUI_SS_DEFAULT_DATE siehe <a href="../functions/GUICtrlCreateDate.htm">GUICtrlCreateDate</a> Funktion.
			</td>
		</tr>
		<tr>
			<td>$DTS_UPDOWN</td>
			<td>0x01</td>
			<td>Platziert ein Up-Down-Control rechts vom Datumsauswahl-Control, um die Zeitwerte zu ver&auml;ndern. Dieser Stil kann anstelle des ausklappbaren Monatskalenders verwendet werden, der standardm&auml;&szlig;ig benutzt wird.</td>
		</tr>
		<tr>
			<td>$DTS_SHOWNONE</td>
			<td>0x02</td>
			<td>Erlaubt es dem Control “no date” als einen g&uuml;ltigen Auswahlwert zu akzeptieren.</td>
		</tr>
		<tr>
			<td>$DTS_LONGDATEFORMAT</td>
			<td>0x04</td>
			<td>Zeigt das Datum im Langformat an. Das Standardformat f&uuml;r diesen Stil ist durch LOCALE_SLONGDATEFORMAT definiert, was Ausgaben wie “Freitag, 19. April 1998” produziert (abh&auml;ngig von den L&auml;ndereinstellungen in der Systemsteuerung).</td>
		</tr>
		<tr>
			<td>$DTS_TIMEFORMAT</td>
			<td>0x09</td>
			<td>Zeigt die Zeit an. Das Standardformat f&uuml;r diesen Stil ist durch LOCALE_STIMEFORMAT definiert, was Ausgaben wie “17:31:42” produziert (abh&auml;ngig von den L&auml;ndereinstellungen in der Systemsteuerung).</td>
		</tr>
		<tr>
			<td>$DTS_RIGHTALIGN</td>
			<td>0x20</td>
			<td>Der ausklappbare Monatskalender wird rechtsb&uuml;ndig mit dem Control gesetzt anstatt linksb&uuml;ndig (Standard).</td>
		</tr>
		<tr>
			<td>$DTS_SHORTDATEFORMAT</td>
			<td>0x00</td>
			<td>Zeigt das Datum im Kurzformat an. Das Standardformat f&uuml;r diesen Stil ist durch LOCALE_SSHORTDATE definiert, was Ausgaben wie "19.04.1998" produziert (abh&auml;ngig von den L&auml;ndereinstellungen in der Systemsteuerung).</td>
		</tr>
	</table>
	<p>&nbsp;</p>
	<p>&nbsp;</p>
	<table>
		<tr>
			<th class="c1">
				<a id="MonthCal"></a>Konstanten f&uuml;r Kalender-Stile
			</th>
						<th class="c2">Interner Wert</th>
						<th>Beschreibung</th>
		</tr>
		<tr>
			<td>
				<a href="#Top">Top</a>
			</td>
			<td>&nbsp;</td>
			<td>
				<p class="center">#include &lt;DateTimeConstants.au3&gt;</p>
			</td>
		</tr>
		<tr>
			<td>Standard/erzwungen</td>
			<td></td>
			<td>
				siehe <a href="../functions/GUICtrlCreateMonthCal.htm">GUICtrlCreateMonthCal</a> Funktion.
			</td>
		</tr>
		<tr>
			<td>$MCS_NOTODAY</td>
			<td>0x10</td>
			<td>Der Monatskalender wird das "heutige" Datum nicht am unteren Rand des Controls anzeigen.</td>
		</tr>
		<tr>
			<td>$MCS_NOTODAYCIRCLE</td>
			<td>0x08</td>
			<td>Der Monatskalender wird keinen Kreis um das "heutige" Datum darstellen.</td>
		</tr>
		<tr>
			<td>$MCS_WEEKNUMBERS</td>
			<td>0x04</td>
			<td>Der Monatskalender wird die Kalenderwochen (1-52) links neben jeder Reihe der Tage anzeigen. Woche 1 ist definiert als die erste Woche, welche mindestens vier Tage beinhalten.</td>
		</tr>
	</table>
	<p>&nbsp;</p>
	<p>&nbsp;</p>
	<table>
		<tr>
			<th class="c1">
				<a id="TreeView"></a>Konstanten f&uuml;r TreeView-Stile
			</th>
						<th class="c2">Interner Wert</th>
									<th>Beschreibung</th>
		</tr>
		<tr>
			<td>
				<a href="#Top">Top</a>
			</td>
			<td>&nbsp;</td>
			<td>
				<p class="center">#include &lt;TreeViewConstants.au3&gt;</p>
			</td>
		</tr>
		<tr>
			<td>Standard/erzwungen</td>
			<td></td>
			<td>
				$GUI_SS_DEFAULT_TREEVIEW siehe <a href="../functions/GUICtrlCreateTreeView.htm">GUICtrlCreateTreeView</a> Funktion.
			</td>
		</tr>
		<tr>
			<td>$TVS_HASBUTTONS</td>
			<td>0x0001</td>
			<td>Zeigt Plus- (+) und Minus- (-) Schaltfl&auml;chen neben "parent"-Eintr&auml;gen an. Der Nutzer klickt auf die Fl&auml;chen, um die Untereintr&auml;ge ("child"-Eintr&auml;ge) zu sehen oder zu verstecken. Um Schaltfl&auml;chen f&uuml;r Eintr&auml;ge auf der Ursprungsebene des Trees anzuzeigen, muss zus&auml;tzlich TVS_LINESATROOT angegeben werden.</td>
		</tr>
		<tr>
			<td>$TVS_HASLINES</td>
			<td>0x0002</td>
			<td>Verwendet Linien, um die Hierarchie der Eintr&auml;ge anzuzeigen.</td>
		</tr>
		<tr>
			<td>$TVS_LINESATROOT</td>
			<td>0x0004</td>
			<td>Verwendet Linien, um Eintr&auml;ge mit der Ursprungsebene des Trees zu verbinden. Dieser Wert wird ignoriert, wenn nicht auch TVS_HASLINES angegeben ist.</td>
		</tr>
		<tr>
			<td>$TVS_DISABLEDRAGDROP</td>
			<td>0x0010</td>
			<td>Verhindert, dass das TreeView-Control TVN_BEGINDRAG-Benachrichtigungen sendet.</td>
		</tr>
		<tr>
			<td>$TVS_SHOWSELALWAYS</td>
			<td>0x0020</td>
			<td>Sorgt daf&uuml;r, dass ein ausgew&auml;hlter Eintrag markiert bleibt, wenn das TreeView-Control den Fokus verliert.</td>
		</tr>
		<tr>
			<td>$TVS_RTLREADING</td>
			<td>0x0040</td>
			<td>Normale Fenster zeigen Text von links nach rechts an (left-to-right, LTR). Fenster k&ouml;nnen <em>gespiegelt</em> werden, um Sprachen wie Hebr&auml;isch oder Arabisch anzuzeigen, die von rechts nach links gelesen werden (right-to-left, RTL). Normalerweise wird Text in TreeViews in der gleichen Richtung angezeigt wie der Text in ihrem zugeh&ouml;rigen "parent"-Fenster. Wenn TVS_RTLREADING gesetzt wird, wird Text im TreeView in der Gegenrichtung zum Text im "parent"-Fenster angezeigt.</td>
		</tr>
		<tr>
			<td>$TVS_NOTOOLTIPS</td>
			<td>0x0080</td>
			<td>Das TreeView-Control unterst&uuml;tzt keine Tooltips</td>
		</tr>
		<tr>
			<td>$TVS_CHECKBOXES</td>
			<td>0x0100</td>
			<td>Aktiviert Checkboxen f&uuml;r die Items in einem TreeView Steuerelement. Ein TreeView Steuerelement wird mit diesem Stil erstellt. Der Stil kann nicht entfernt werden. Stattdessen mu&szlig; das Steuerelement zerst&ouml;rt werden und ein neues an dessen Stelle erstellt werden.</td>
		</tr>
		<tr>
			<td>$TVS_TRACKSELECT</td>
			<td>0x0200</td>
			<td>Erm&ouml;glicht "hot tracking" in einem TreeView-Control, d.h. der Knoten (Node), &uuml;ber dem sich der Mauszeiger befindet, wird zum aktiven Knoten.</td>
		</tr>
		<tr>
			<td>$TVS_SINGLEEXPAND</td>
			<td>0x0400</td>
			<td>Wenn dieser Stil verwendet wird, f&uuml;hrt eine &Auml;nderung der Auswahl im TreeView automatisch dazu, dass die Untereintr&auml;ge des neu markierten Eintrags angezeigt und die Untereintr&auml;ge des vorher markierten Eintrags versteckt werden. Wird die Maus benutzt, um den ausgew&auml;hlten Eintrag anzuklicken und dieser zuvor nicht erweitert war, werden nun die Untereintr&auml;ge sichtbar gemacht. Dr&uuml;ckt der Nutzer die CTRL-Taste (Strg-Taste), w&auml;hrend er auf den Eintrag klickt, bleibt der vorherige Eintrag erweitert.</td>
		</tr>
		<tr>
			<td>$TVS_FULLROWSELECT</td>
			<td>0x1000</td>
			<td>Erlaubt das Ausw&auml;hlen einer kompletten Zeile im TreeView. Die gesamte Zeile des ausgew&auml;hlten Eintrags wird markiert. Selbst wenn irgendwo in der Zeile eines Eintrags geklickt wird, wird ebenfalls die gesamte Zeile ausgew&auml;hlt. Dieser Stil kann nicht zusammen mit dem TVS_HASLINES-Stil verwendet werden.</td>
		</tr>
		<tr>
			<td>$TVS_NOSCROLL</td>
			<td>0x2000</td>
			<td>Verhindert das horizontale und vertikale Scrollen im Control. Das Control zeigt keinen Scrollbalken an.</td>
		</tr>
		<tr>
			<td>$TVS_NONEVENHEIGHT</td>
			<td>0x4000</td>
			<td>Die H&ouml;he der Eintr&auml;ge kann mit der TVM_SETITEMHEIGHT-Nachricht auf einen ungeraden Wert gesetzt werden. Standardm&auml;&szlig;ig muss die H&ouml;he eines Eintrags eine gerade Zahl sein.</td>
		</tr>
	</table>
	<p>&nbsp;</p>
	<p>&nbsp;</p>
	<table>
		<tr>
			<th class="c1">
				<a id="Slider"></a>Konstanten f&uuml;r Slider-Stile
			</th>
						<th class="c2">Interner Wert</th>
						<th>Beschreibung</th>
		</tr>
		<tr>
			<td>
				<a href="#Top">Top</a>
			</td>
			<td>&nbsp;</td>
			<td>
				<p class="center">#include &lt;SliderConstants.au3&gt;</p>
			</td>
		</tr>
		<tr>
			<td>Standard/erzwungen</td>
			<td></td>
			<td>
				$GUI_SS_DEFAULT_SLIDER siehe <a href="../functions/GUICtrlCreateSlider.htm">GUICtrlCreateSlider</a> Funktion.
			</td>
		</tr>
		<tr>
			<td>$TBS_AUTOTICKS</td>
			<td>0x0001</td>
			<td>F&uuml;gt Skalenstriche hinzu, wenn man den Wertebereich des Reglers mit der TBM_SETRANGE-Nachricht setzt.</td>
		</tr>
		<tr>
			<td>$TBS_BOTH</td>
			<td>0x0008</td>
			<td>Platziert Skalenstriche auf beiden Seiten der Reglerschiene.</td>
		</tr>
		<tr>
			<td>$TBS_BOTTOM</td>
			<td>0x0000</td>
			<td>Platziert Skalenstriche unter einer horizontalen Reglerschiene.</td>
		</tr>
		<tr>
			<td>$TBS_HORZ</td>
			<td>0x0000</td>
			<td>Definiert einen horizontalen Slider. Das ist der Standardwert.</td>
		</tr>
		<tr>
			<td>$TBS_VERT</td>
			<td>0x0002</td>
			<td>Definiert einen vertikalen Slider.</td>
		</tr>
		<tr>
			<td>$TBS_NOTHUMB</td>
			<td>0x0080</td>
			<td>Definiert eine Reglerschiene ohne Schiebeknopf.</td>
		</tr>
		<tr>
			<td>$TBS_NOTICKS</td>
			<td>0x0010</td>
			<td>Definiert eine Reglerschiene ohne Skalenstriche.</td>
		</tr>
		<tr>
			<td>$TBS_LEFT</td>
			<td>0x0004</td>
			<td>Platziert Skalenstriche auf der linken Seite einer vertikalen Reglerschiene.</td>
		</tr>
		<tr>
			<td>$TBS_RIGHT</td>
			<td>0x0000</td>
			<td>Platziert Skalenstriche auf der rechten Seite einer vertikalen Reglerschiene.</td>
		</tr>
		<tr>
			<td>$TBS_TOP</td>
			<td>0x0004</td>
			<td>Platziert Skalenstriche &uuml;ber einer horizontalen Reglerschiene.</td>
		</tr>
	</table>
	<p>&nbsp;</p>
	<p>&nbsp;</p>
	<table>
		<tr>
			<th class="c1">
				<a id="ListView"></a>Konstanten f&uuml;r ListView-Stile
			</th>
						<th class="c2">Interner Wert</th>
						<th>Beschreibung</th>
		</tr>
		<tr>
			<td>
				<a href="#Top">Top</a>
			</td>
			<td>&nbsp;</td>
			<td>
				<p class="center">#include &lt;ListViewConstants.au3&gt;</p>
			</td>
		</tr>
		<tr>
			<td>Standard/erzwungen</td>
			<td></td>
			<td>
				$GUI_SS_DEFAULT_LISTVIEW siehe <a href="../functions/GUICtrlCreateListView.htm">GUICtrlCreateListView</a> Funktion.
			</td>
		</tr>
		<tr>
			<td>$LVS_ICON</td>
			<td>0x0000</td>
			<td>Dieser Stil bestimmt die "Icon-Ansicht".</td>
		</tr>
		<tr>
			<td>$LVS_REPORT</td>
			<td>0x0001</td>
			<td>Dieser Stil bestimmt die "Report-Ansicht".</td>
		</tr>
		<tr>
			<td>$LVS_SMALLICON</td>
			<td>0x0002</td>
			<td>Dieser Stil bestimmt die "Kleine Icons-Ansicht".</td>
		</tr>
		<tr>
			<td>$LVS_LIST</td>
			<td>0x0003</td>
			<td>Dieser Stil bestimmt die "Listenansicht".</td>
		</tr>
		<tr>
			<td>$LVS_EDITLABELS</td>
			<td>0x0200</td>
			<td>Text von Eintr&auml;gen kann an Ort und Stelle editiert werden.</td>
		</tr>
		<tr>
			<td>$LVS_NOCOLUMNHEADER</td>
			<td>0x4000</td>
			<td>In der Report-Ansicht werden keine Spalten&uuml;berschriften angezeigt. Standardm&auml;&szlig;ig haben Spalten in der Report-Ansicht eine &Uuml;berschrift.</td>
		</tr>
		<tr>
			<td>$LVS_NOSORTHEADER</td>
			<td>0x8000</td>
			<td>Spalten&uuml;berschriften funktionieren nicht als Schaltfl&auml;chen. Dieser Stil kann definiert werden, wenn das Anklicken der Spalten&uuml;berschrift keine Aktion ausl&ouml;sen soll, wie beispielsweise das Sortieren der Eintr&auml;ge.</td>
		</tr>
		<tr>
			<td>$LVS_SINGLESEL</td>
			<td>0x0004</td>
			<td>Nur ein einzelner Eintrag kann ausgew&auml;hlt werden.</td>
		</tr>
		<tr>
			<td>$LVS_SHOWSELALWAYS</td>
			<td>0x0008</td>
			<td>Die Markierung, soweit vorhanden, wird immer angezeigt, auch wenn das Control nicht den Fokus hat.</td>
		</tr>
		<tr>
			<td>$LVS_SORTASCENDING</td>
			<td>0x0010</td>
			<td>Item-Indexe werden basierend auf den Item-Text in aufsteigender (ascending) Reihenfolge sortiert.</td>
		</tr>
		<tr>
			<td>$LVS_SORTDESCENDING</td>
			<td>0x0020</td>
			<td>Item-Indexe werden basierend auf den Item-Text in absteigender (descending) Reihenfolge sortiert</td>
		</tr>
		<tr>
			<td>$LVS_NOLABELWRAP</td>
			<td>0x0080</td>
			<td>Der Item-Text wird in der "Icon" Ansicht in einer einzelnen Zeile dargestellt. Standardm&auml;&szlig;ig werden Item-Texte in der "Icon-Ansicht" verpackt.</td>
		</tr>
	</table>
	<p>&nbsp;</p>
	<p>&nbsp;</p>
	<table>
		<tr>
			<th class="c1">
				<a id="ListViewExtended"></a>Konstanten f&uuml;r erweiterte ListView-Stile
			</th>
						<th class="c2">Interner Wert</th>
						<th>Beschreibung</th>
		</tr>
		<tr>
			<td>
				<a href="#Top">Top</a>
			</td>
			<td>&nbsp;</td>
			<td>
				<p class="center">#include &lt;ListViewConstants.au3&gt;</p>
			</td>
		</tr>
		<tr>
			<td>$LVS_EX_FULLROWSELECT</td>
			<td>0x00000020</td>
			<td>Wenn ein Eintrag markiert ist, werden der Eintrag und all seine Untereintr&auml;ge hervorgehoben.</td>
		</tr>
		<tr>
			<td>$LVS_EX_GRIDLINES</td>
			<td>0x00000001</td>
			<td>Zeigt Gitternetzlinien rund um die Eintr&auml;ge und Untereintr&auml;ge an.</td>
		</tr>
		<tr>
			<td>$LVS_EX_HEADERDRAGDROP</td>
			<td>0x00000010</td>
			<td>Aktiviert die Drag&Drop Anordnung der Spalten.</td>
		</tr>
		<tr>
			<td>$LVS_EX_TRACKSELECT</td>
			<td>0x00000008</td>
			<td>Aktiviert die "hot-track" Auswahl im Control. "Hot-track" Auswahl bedeutet, dass ein Eintrag automatisch markiert wird, wenn der Cursor f&uuml;r eine bestimmte Zeit &uuml;ber dem Eintrag stehen bleibt.</td>
		</tr>
		<tr>
			<td>$LVS_EX_CHECKBOXES</td>
			<td>0x00000004</td>
			<td>Aktiviert Checkboxen f&uuml;r Eintr&auml;ge in einem Listview-Control.</td>
		</tr>
		<tr>
			<td>$LVS_EX_BORDERSELECT</td>
			<td>0x00008000</td>
			<td>Wenn ein Eintrag markiert ist, &auml;ndert sich die Randfarbe des Eintrags.</td>
		</tr>
		<tr>
			<td>$LVS_EX_DOUBLEBUFFER</td>
			<td>0x00010000</td>
			<td>Zeichnet mit double-buffering, welches Flimmern reduziert. Dieser erweiterte Stil aktiviert also die "alpha-blended marquee" Auswahl auf Systemen die dies unterst&uuml;tzen.</td>
		</tr>
		<tr>
			<td>$LVS_EX_FLATSB</td>
			<td>0x00000100</td>
			<td>Aktiviert flache Scrollbalken in der Listenansicht.</td>
		</tr>
		<tr>
			<td>$LVS_EX_MULTIWORKAREAS</td>
			<td>0x00002000</td>
			<td>Das Control rastet seine Icons nicht automatisch ein, bis ein oder mehrere Arbeitsfl&auml;chen definiert wurden.</td>
		</tr>
		<tr>
			<td>$LVS_EX_SNAPTOGRID</td>
			<td>0x00080000</td>
			<td>Eintr&auml;ge am Gitter ausrichten.</td>
		</tr>
		<tr>
			<td>$LVS_EX_SUBITEMIMAGES</td>
			<td>0x00000002</td>
			<td>Bilder f&uuml;r Untereintr&auml;ge k&ouml;nnen dargestellt werden.</td>
		</tr>
		<tr>
			<td>$LVS_EX_INFOTIP</td>
			<td>0x00000400</td>
			<td>Zeigt einen Tooltip wenn das Item nicht komplett sichtbar ist. Sended einen Benachrichtigung an $LVN_GETINFOTIP</td>
		</tr>
	</table>
</body>
</html>
