<!DOCTYPE html>
<html>
<head>
	<title>AutoIt</title>
	<meta charset="utf-8">
	<link href="css/default.css" rel="stylesheet">
</head>
<body>
	<p align="center"><img alt="" border="1" height="100" src="images/autoit_10_240x100.jpg" width="642"></p>
<p align="center"><strong>v3.3.14.5<br /> (Stand der &Uuml;bersetzung der Hilfe ins Deutsche: 13.04.2020)</strong></p>
  <p class="center">&#169;1999-2018 Jonathan Bennett &amp; <a href="credits.htm">AutoIt Team</a></p>
	<p align="center"><a class="ext" href="https://www.autoitscript.com/site/autoit/" target="_blank">Offizielle AutoIt-Homepage</a> <a class="ext" href="https://www.autoitscript.com/forum/index.php?">Offizielles Englisches AutoIt-Forum</a> - <a class="ext" href="https://autoit.de/">Deutsches AutoIt-Forum</a><br>
	<a class="ext" href="credits.htm">Danksagungen</a> - <a class="ext" href="uebersetzer.htm">&Uuml;bersetzer</a></p>
	<h1>Einf&uuml;hrung</h1>
	<p>AutoIt v3 ist eine BASIC-artige Freeware-Skriptsprache. Sie wurde entwickelt, um die Windows-GUI zu automatisieren und f&uuml;r allgemeines Programmieren. Sie nutzt eine Kombination von simulierten Tastendr&uuml;cken, Mausbewegungen und -klicks sowie Windows- bzw. Control-Manipulation, um Aufgaben zu automatisieren, die in anderen Sprachen nicht m&ouml;glich sind oder nur mit befriedigender Stabilit&auml;t und Zuverl&auml;ssigkeit m&ouml;glich w&auml;ren (z.B. VBScript und SendKeys). AutoIt ist auch sehr klein, unabh&auml;ngig und l&auml;uft auf allen Versionen von Windows ohne zus&auml;tzliche "Runtimes".<br>
	<br></p>
	<p>AutoIt wurde urspr&uuml;nglich f&uuml;r "PC-Rollout"-Situationen entwickelt, bei denen tausende PCs auf die gleiche Weise konfiguriert werden m&uuml;ssen. Mit der Zeit wurde AutoIt eine m&auml;chtige Programmiersprache, welche komplexe Ausdr&uuml;cke, benutzerdefinierte Funktionen, Schleifen und alles Andere, was altgediente Programmierer erwarten w&uuml;rden, enth&auml;lt. Features::</p>
	<ul>
		<li>Einfach zu lernende BASIC-&auml;hnliche Syntax</li>
		<li>Tastendr&uuml;cke und Mausbewegungen simulieren</li>
		<li>Windows und Prozesse manipulieren</li>
		<li>Mit allen Windows-Standardsteuerelementen arbeiten</li>
		<li>Skripte k&ouml;nnen in direkt ausf&uuml;hrbare exe-Dateien umgewandelt werden</li>
		<li>Grafische Benutzeroberfl&auml;chen (GUIs) erstellen</li>
		<li>COM Unterst&uuml;tzung</li>
		<li>Regul&auml;re Ausdr&uuml;cke</li>
		<li>Direkt externe DLLs und Windows-API-Funktionen aufrufen</li>
		<li>Programmierbare RunAs-Funktionen</li>
		<li>Detailierte Hilfedatei und grosse communitybasierende Supportforen</li>
		<li>Kompatibel mit Windows XP SP3 / 2003 SP2 / Vista / 2008 / Windows 7 / 2008 R2 / Windows 8 / 2012 R2</li>
		<li>Unicode- und x64-Support</li>
		<li>Digital signiert f&uuml;r sorgenfreies Arbeiten</li>
		<li>Funktioniert mit Windows Vista's Benutzerkontensteuerung (UAC)</li>
	</ul>
	<p>AutoIt wurde so konzipiert, dass es so klein wie m&ouml;glich und eigenst&auml;ndig ist, ohne dass externe DLL-Dateien oder Registrierungseintr&auml;ge erforderlich sind, um die Verwendung auf Servern zu erm&ouml;glichen.. Skripte k&ouml;nnen mit <strong>Aut2Exe</strong> in selbstst&auml;ndig ausf&uuml;hrbare Dateien kompiliert werden.</p>
	<p>Es wird auch eine kombinierte COM- und DLL-Version von AutoIt unterst&uuml;tzt. Diese hei&szlig;t AutoItx, welche es erlaubt, einzigartige Features von AutoIt deiner eigenen Lieblingsprogrammiersprache hinzuzuf&uuml;gen!</p>
	<p>Das Beste: AutoIt bleibt weiterhin FREEWARE, also <strong>kostenlos</strong>. Aber wenn Du etwas f&uuml;r die Unterst&uuml;tzung dieses Projektes tun m&ouml;chtest, sei es in ideeller oder finanzieller Hinsicht, dann kannst Du dies auf der AutoIt <a class="ext" href="https://www.autoitscript.com/site/autoit/">Homepage</a> tun.</p>
	<p></p>
	<h1>Features im Detail</h1>
	<p><strong>Basic-&auml;hnliche Syntax und umfangreiche Funktionssammlung</strong></p>
	<p>AutoIt hat eine Basic-&auml;hnliche Syntax, was bedeutet, dass die meisten Leute, die jemals ein Skript geschrieben haben oder eine schwierigere Sprache benutzt haben, keinerlei Probleme haben werden, AutoIt zu verstehen.</p>
	<p>Obwohl es als einfaches Automationstool begann, besitzt AutoIt nun Funktionen und Features, welche es erlauben, es als professionelle Programmiersprache einzusetzen (nat&uuml;rlich immernoch mit der Unterst&uuml;tzung f&uuml;r die Automation!). Enthaltene Programmfeatures:</p>
	<ul>
		<li>Die gew&ouml;hnlichen Elemente f&uuml;r Funktionen, Schleifen und Ausdr&uuml;cke</li>
		<li>Eine atemberaubende Menge an Funktionen, die mit Strings arbeiten <strong>und</strong> eine mit Perl kompatible Engine, um regul&auml;re Ausdr&uuml;cke zu verarbeiten (unter Verwendung der <a href="http://www.pcre.org/">PCRE</a>-Bibliothek).
		</li>
		<li>COM-Unterst&uuml;tzung</li>
		<li>Win32- und andere DLL-APIs aufrufen</li>
	</ul>
	<p></p>
	<p><strong>Eingebauter Editor mit Syntax-Hervorhebung</strong></p>
	<p>AutoIt gibt es mit einer angepassten "abgespeckten" Version von SciTE, welche das &Auml;ndern von Skripten einfach macht. Benutzer k&ouml;nnen auch unter <a href="https://www.autoitscript.com/site/autoit-script-editor/">eine komplette Version von SciTE</a> herunterladen. Diese enth&auml;lt zus&auml;tzliche Tools, die manche Dinge einfacher machen.</p>
	<p></p>
	<p><strong>Selbstausf&uuml;hrend und klein</strong></p>
	<p>AutoIt ist eine sehr kleine und selbstausf&uuml;hrbare Anwendung, ohne das irgendeine Art von Runtimes wie .NET oder VB ben&ouml;tigt wird. Alles was ben&ouml;tigt wird, um AutoIt Skripte zu starten, ist die Haupt-exe von AutoIt(AutoIt3.exe) und das Skript. Skripte k&ouml;nnen in selbstausf&uuml;hrende Anwendungen mit dem enthaltenen Skript-Comiler <strong>Aut2Exe</strong> kompiliert werden.</p>
	<p></p>
	<p><strong>Internationale und 64-bit Unterst&uuml;tzung</strong></p>
	<p>AutoIt unterst&uuml;tzt Unicode und enth&auml;lt x64-Versionen aller Hauptkomponenten! Wieviele andere freie Programmiersprachen k&ouml;nnen dies von sich behaupten?</p>
	<p></p>
	<p><strong>Tastatur- und Maussimulation</strong></p>
	<p>Viel Zeit wurde in die Optimierung von Tastatur- und Maussimulationsfunktionen investiert, damit dies in allen Versionen von Windows reibungslos funktioniert. Alle Maus- und Tastatur-Routinen sind sehr anpassungsf&auml;hig in Bezug auf die Simulations-"Geschwindigkeit" und -Funktionalit&auml;t.</p>
	<p></p>
	<p><strong>Fensterhandhabung</strong></p>
	<p>Man kann Fenster bewegen, verbergen, zeigen, skalieren, aktivieren, schlie&szlig;en und sonst fast alles, was man mit Fenstern tun will. Fenster k&ouml;nnen durch den Titel, Text auf dem Fenster, Gr&ouml;&szlig;e, Position, Klasse und Win32-API-Funktionen identifiziert werden</p>
	<p></p>
	<p><strong>Controls</strong></p>
	<p>Man erh&auml;lt direkt Informationen von Editboxen, Checkboxen, Listboxen, Combofeldern, Buttons, Statusbars - ohne das Risiko, dass Tastatureingaben verloren gehen. Es funktioniert auch mit Controls, die nicht aktiv sind</p>
	<p></p>
	<p><strong>Grafische Benutzeroberfl&auml;chen (GUIs)</strong></p>
	<p align="left">AutoIt v3 erm&ouml;glicht es, komplexe GUIs zu erstellen - so wie untenstehende!</p>
	<p class="center"><img alt="GUI Beispiel 1" src="images/gui_eg1.png">&nbsp; <img alt="GUI Beispiel 2" src="images/gui_eg2.png"></p>
	<p></p>
	<p></p>
	<p>Und vieles, vieles mehr...</p>
	<p></p>
	<p></p>
</body>
</html>
