<!DOCTYPE html>
<html>
<head>
  <title>&Uuml;bersetzer</title>
  <meta charset="utf-8">
  <link href="css/default.css" rel="stylesheet">
</head>
<body>
<h1>&Uuml;bersetzer</h1>

<br>
Diese Hilfe wurde von der deutschen AutoIt-Community auf <a href="https://autoit.de" target="_blank"><b>https://autoit.de</b></a> &uuml;bersetzt.<br />Sie basiert wesentlich auf der Vorarbeit, die 
die &Uuml;bersetzer der Hilfe von Version 3.1.0 geleistet haben.

<h3>Die &Uuml;bersetzer der Version 3.1.0:</h3>
Andrea, Artus, Holger, Johannes und Reinhard.

<br><br><br>
<br><br><br>

<h3>Kurze Historie</h3>
Nachdem im Juli 2005 die deutsche Hilfe f&uuml;r 3.1.0 fertiggestellt wurde, war lange Zeit Ruhe eingekehrt in Punkte &Uuml;bersetzung.<br><br>

Im Dezember 2007 entschloss man sich dann das ganze wieder aufzunehmen. Es wurde von peethebee eine Onlineplattform eingerichtet, wo jeder Dateien &uuml;bersetzen und reviewen konnte. <br>
Begonnen wurde die &Uuml;bersetzung mit den vielgew&uuml;nschten _IE...-Funktionen der Version 3.2.10.0. <br><br>

Im Laufe der Zeit wurden dann deutsche Hilfedateien f&uuml;r die AutoIt Versionen 3.2.10.0 und 3.3.0.0 erstellt.<br>
Nachdem immer mehr Dateien online waren, war eine neue Onlineplattform notwendig. Der_Doc &uuml;bernahm dies und funktionierte den Code von peethebee um, so dass die Plattform deutlich schneller und komfortabler wurde.<br><br>

Im September 2009 wurde dann die erste komplette deutsche Hilfe erstellt. Sie war f&uuml;r die AutoIt Version 3.3.0.0. Es wurden alle Funktionsbeschreibungen, Beispiele und htm-Seiten &uuml;bersetzt. <br><br>

Da Version 3.3.4.0 nur einen Monat nach 3.3.2.0 erschienen ist, wurde das bereits laufende &auml;ndern der Dateien auf 3.3.4.0 erweitert. Somit erschien f&uuml;r 3.3.2.0 keine deutsche Hilfe.<br>
Im Februar 2010 wurde dann die erste komplette deutsche Hilfe f&uuml;r 3.3.4.0 erstellt. <br><br>

Im M&auml;rz 2010 wurde dann die erste komplette deutsche Hilfe f&uuml;r 3.3.6.0 erstellt. <br><br>

Im Mai 2010 wurde dann die erste komplette deutsche Hilfe f&uuml;r 3.3.6.1 erstellt. Jedoch gab es seit 3.3.6.0 keine &Auml;nderungen. Es wurden lediglich Fehler im Programm selbst behoben. <br><br>

Im Dezember 2012 wurde dann die erste komplette deutsche Hilfe f&uuml;r 3.3.8.1 erstellt. Dies war jedoch ein langer und steiniger Weg. Die &Uuml;bersetzseite mu&szlig;te aus Sicherheitsgr&uuml;nden im Juni 2011 offline genommen werden.<br>
Durch fehlende Zeit und unvorhersehbare Ereignisse war es trotz mehreren Anl&auml;ufen den Usern Der_Doc, Chip, i2c und Blume nicht m&ouml;glich die &Uuml;bersetzseite wieder auf Vordermann zu bringen.<br>
Deshalb wurden ein Gro&szlig;teil der Dateien lokal von Tweaky und direkt &uuml;ber das Forum &uuml;bersetzt.<br>
Im Dezember 2013 wurde eine fehlerbereinigte deutsche Hilfe f&uuml;r 3.3.8.1 angeboten. Was damals keiner wusste, es sollte f&uuml;r lange, lange Zeit die letzte sein.<br><br>

Die &Auml;nderungen f&uuml;r die Hilfe f&uuml;r 3.3.10.2 waren enorm. Es wurden fast alle Dateien ver&auml;ndert. Das es leider noch keine &Uuml;bersetzseite gab und auch die Motivation der Forumsmitglieder zu helfen stark nachlie&szlig;, wurde die Hilfe f&uuml;r 3.3.10.0 nie ver&ouml;ffentlicht. <br><br>

Erst im August 2017 wurde bei einer handvoll Usern der Ehrgeiz wieder geweckt.<br>
Zuerst wurden die ge&auml;nderten Sachen auf die Version 3.3.10.2 angepasst.<br>
Dann folgte das anpassen der ge&auml;nderten Sachen auf die Version 3.3.14.2.<br>
Im November 2017 war dann die deutsche Hilfe f&uuml;r 3.3.14.2 nach fast 4 Jahren Funkstille fertig.<br>
Jedoch waren noch viele Funktionen und Beispiele, die seit 3.3.8.1 hinzugekommen sind, noch komplett auf Englisch.<br>
Gab es jedoch eine deutsche Beschreibung f&uuml;r die Funktion, war diese auch f&uuml;r 3.3.14.2 angepasst.<br>
Als Neuerung in der Hilfe-Datei gibt es nun bei allen &uuml;bersetzten Funktionen rechts oben die M&ouml;glichkeit sich die originale englische Funktion anzusehen.<br><br>

Im August 2018 wurde dann die deutsche Hilfe f&uuml;r 3.3.14.5 erstellt. <br><br>

Im April 2022 wurde dann die deutsche Hilfe f&uuml;r 3.3.16.0 erstellt. <br><br>

Im Dezember 2022 wurde dann die deutsche Hilfe f&uuml;r 3.3.16.1 erstellt. <br>
Im April 2023 wurde dann ein DarkMode in die deutsche Hilfe eingebaut. <br>
In der Online-Hilfe kann dieser per Button ein- und ausgeschaltet werden. Da dies in der Offline-Hilfe nicht m&ouml;glich ist, gibt es 2 separate Hilfe-Dateien. <br><br>

 

<br><br><br>
<br><br><br>

<h3>Hier sollen die &Uuml;bersetzer der Hilfe zu Version 3.2.10.0 und 3.3.0.0 gew&uuml;rdigt werden:</h3>
<u>Sortiert nach der Anzahl der &Uuml;bersetzungen:</u> Tweaky, Der_Doc, Greenhorn, 
Ashpool, BigRox, Rasta, muh_kuh, Schnuffel, Spion, TrueMu, peethebee, twister, 
bernd670, DailyAgony, BugFix, PhilRip, blubbstar, wian, Fast2, unearth, azunai, 
Carsten, Mignon, Bitboy, progandy, MatthiasG., Shadowmaster6, markusbab, micha_he, 
jiyan006, Peter Leenders, Xenobiologist, Vinschni, serials, OUTSID3R, anno2008, 
Wambo, GerhardSchr, Wesloth, derda, Diva31, Huggy, Tom99, Crazy-A, GtaSpider, 
Purzel, Andy, danker, FireFlyer, tobitobitobi, AspirinJunkie, rwo4ever, 
Scripter192, TOMTOM25m, Icynator, Turbolocke, Waluev, windforce, akira2012, 
donic208, GunFood, i2c, Lyrex, Nightraven, Obonob, Padmak, PokerFace, Powerbitch, 
Schoppe, A.IX0, Alina, Dietmar, DonDaniello, FichteFoll, Greek, HHS, JuraX, 
karroffel, leviathan, m-obi, PapaPeter, schnuecks, sithlord95, sycho und war10ck -- vielen Dank an alle!

<br><br>
<br><br>

<h3>Hier sollen die &Uuml;bersetzer der Hilfe zu Version 3.3.2.0 gew&uuml;rdigt werden:</h3>
<u>Sortiert nach der Anzahl der &Uuml;bersetzungen:</u> Tweaky, Der_Doc, Greenhorn, 
Ashpool, FichteFoll, BigRox, JuraX, Raupi, name22, water, Arkaneus, Ealendil, 
progandy, rampage, A.IX0, Diva31, PokerFace, Scripter192, Schnuffel, Schrubber, 
Jakolo, mille86, Sprenger120, i2c, DonDaniello, PrideRage, chip, ChrisEU, donic208, 
Dr.Doktor, Greek, nefas, PapaPeter und peethebee -- vielen Dank an alle!

<br><br>
<br><br>

<h3>Hier sollen die &Uuml;bersetzer der Hilfe zu Version 3.3.4.0 gew&uuml;rdigt werden:</h3>
<u>Sortiert nach der Anzahl der &Uuml;bersetzungen:</u> Tweaky, Der_Doc, water und Greenhorn -- vielen Dank an alle!

<br><br>
<br><br>

<h3>Hier sollen die &Uuml;bersetzer der Hilfe zu Version 3.3.6.0 gew&uuml;rdigt werden:</h3>
<u>Sortiert nach der Anzahl der &Uuml;bersetzungen:</u> Tweaky, Greenhorn, BigRox, 
Der_Doc, Diva31, i2c, JuraX und PrideRage -- vielen Dank an alle!

<br><br>
<br><br>

<h3>Hier sollen die &Uuml;bersetzer der Hilfe zu Version 3.3.6.1 gew&uuml;rdigt werden:</h3>
<u>Sortiert nach der Anzahl der &Uuml;bersetzungen:</u> Tweaky, Der_Doc und Greenhorn -- vielen Dank an alle!

<br><br>
<br><br>

<h3>Hier sollen die &Uuml;bersetzer der Hilfe zu Version 3.3.8.1 gew&uuml;rdigt werden:</h3>
<u>Sortiert nach der Anzahl der &Uuml;bersetzungen:</u> Tweaky, minx, stayawayknight, Blume, name22, BugFix, Greenhorn und RavensGate -- vielen Dank an alle!

<br><br>
<br><br>

<h3>Hier sollen die &Uuml;bersetzer der Hilfe zu Version 3.3.10.2 gew&uuml;rdigt werden:</h3>
<u>Sortiert nach der Anzahl der &Uuml;bersetzungen:</u> Tweaky, Indi2Go, chip, alpines, Kanashius, Xenon, i2c, bollen, Make-Grafik, rynow, Alizame, BigRox, chesstiger, PuReIroNie und Homelike Jester -- vielen Dank an alle!

<br><br>
<br><br>

<h3>Hier sollen die &Uuml;bersetzer der Hilfe zu Version 3.3.14.2 gew&uuml;rdigt werden:</h3>
<u>Sortiert nach der Anzahl der &Uuml;bersetzungen:</u> Tweaky, alpines, Kanashius, water und Bitnugger -- vielen Dank an alle!

<br><br>
<br><br>

<h3>Hier sollen die &Uuml;bersetzer der Hilfe zu Version 3.3.14.5 gew&uuml;rdigt werden:</h3>
<u>Sortiert nach der Anzahl der &Uuml;bersetzungen:</u> Tweaky, BugFix -- vielen Dank an alle!

<br><br>
<br><br>

<h3>Hier sollen die &Uuml;bersetzer der Hilfe zu Version 3.3.16.0 gew&uuml;rdigt werden:</h3>
<u>Sortiert nach der Anzahl der &Uuml;bersetzungen:</u> Tweaky -- vielen Dank an alle!

<br><br>
<br><br>

<h3>Hier sollen die &Uuml;bersetzer der Hilfe zu Version 3.3.16.1 gew&uuml;rdigt werden:</h3>
<u>Sortiert nach der Anzahl der &Uuml;bersetzungen:</u> Tweaky, water -- vielen Dank an alle!

<br><br>
<br><br>
<br><br>



Besonderer Dank soll an dieser Stelle an Tweaky gehen, der immer wieder angespornt und motiviert hat!
<br>
<br>
Jeder kann am Ausbau dieser Hilfe mitwirken, mehr Informationen dazu unter <a href="https://autoit.de/index.php?board/45-&uuml;bersetzung-der-hilfe-datei-ins-deutsche/">https://autoit.de/index.php?board/45-&uuml;bersetzung-der-hilfe-datei-ins-deutsche/</a>.

<br><br><br>
<br><br><br>
       
</p>
<h3>Eine Ver&ouml;ffentlichung oder Verlinkung auf anderen Webseiten oder eine Weitergabe auf Datentr&auml;gern ist mit dem Team von AutoIt.de (admins@autoit.de) abzusprechen!</h3> In der Regel wird die Genehmigung zur Weitergabe erteilt.

<br><br><br>
<br><br><br>

Hoffentlich bis zur n&auml;chsten AutoIt-Version,<br>

<i>Gun-Food f&uuml;r das Team von <a href="https://autoit.de/">AutoIt.de</a></i></body></html>
