<!DOCTYPE html>
<html>
<head>
<title>Schl&uuml;sselwort $tagWINDOWPLACEMENT</title>
<meta charset="utf-8">
<link href="../css/default.css" rel="stylesheet">
</head>

<body>
<h1 class="small">Schl&uuml;sselwortreferenz</h1>
<hr style="height:0px">
<div class="top"><h1>$tagWINDOWPLACEMENT</h1><div>
<div id="flagtext">Beschreibung anzeigen in</div>
<div id="flaglink"> <a href="../libfunctions_en/$tagWINDOWPLACEMENT.htm"><img src="../images/Flagge_en.png" height="29" width="36" border=0 hspace=10/></a></div>
<br style="clear: both;">
<p style="margin:2px 0 0 0;" class="funcdesc">Die WINDOWPLACEMENT Struktur enth&auml;lt Informationen &uuml;ber die Anordnung eines Fensters auf dem Bildschirm<br /></p>
<p class="codeheader">
Global Const $tagWINDOWPLACEMENT = "UINT length; UINT flags; UINT showCmd; int ptMinPosition[2]; int ptMaxPosition[2]; int rcNormalPosition[4]"<br />
</p>

<h2>Parameter</h2>
<table>
<tr>
<td style="width:15%">length</td>
<td style="width:85%">Bestimmt die Gr&ouml;&szlig;e der Struktur, in Bytes</td>
</tr>
<tr>
<td>flags</td>
<td>Bestimmt die Flags, welche die Position des minimierten Fensters steuern, und die Methode mit der das Fenster wiederhergestellt wird. Dieses Mitglied kann einer oder mehrere der folgenden Werte sein:<br />
&nbsp;&nbsp;&nbsp; $WPF_ASYNCWINDOWPLACEMENT - Wenn der aufrufende Thread und der Thread, der das Fenster besitzt an verschiedene Eingabe-Warteschlangen gebunden sind, sendet das System die Anfrage an den Thread der das Fenster besitzt.<br />
&nbsp;&nbsp;&nbsp; $WPF_RESTORETOMAXIMIZED - Legt fest, dass das wiederhergestellte Fenster maximiert wird, unabh&auml;ngig davon, ob es zuvor maximiert oder minimiert gewesen ist.<br />
&nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp; Diese Einstellung ist nur g&uuml;ltig, wenn das Fenster das n&auml;chste Mal wiederhergestellt wird. Es &auml;ndert nicht das standardm&auml;&szlig;ige Verhalten bei Wiederherstellung.<br />
&nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp; Dieses Flag ist nur g&uuml;ltig, wenn der @SW_SHOWMINIMIZED Wert f&uuml;r das <strong>showCmd</strong> Mitglied angegeben ist.<br />
&nbsp;&nbsp;&nbsp; $WPF_SETMINPOSITION - Gibt an, dass die Koordinaten des minimierten Fensters m&ouml;glicherweise festgelegt sind.<br />
&nbsp;&nbsp;&nbsp;   Dieses Flag muss angegeben werden, wenn die Koordinaten im <strong>ptMinPosition</strong> Mitglied bestimmt sind.</td>
</tr>
<tr>
<td>showCmd</td>
<td>Bestimmt den aktuellen Anzeigezustand des Fensters. Dieses Mitglied kann einer der folgenden Werte sein:<br />
&nbsp;&nbsp;&nbsp; @SW_HIDE - Versteckt das Fenster und aktiviert ein anderes Fenster.<br />
&nbsp;&nbsp;&nbsp; @SW_MAXIMIZE - Maximiert das angegebene Fenster.<br />
&nbsp;&nbsp;&nbsp; @SW_MINIMIZE - Minimizes das angegebene Fenster und das n&auml;chste Top-Level Fenster in der Z-Anordnung.<br />
&nbsp;&nbsp;&nbsp; @SW_RESTORE - Aktiviert und zeigt das Fenster. Ist das Fenster minimiert oder maximiert, stellt das System seine urspr&uuml;gliche Gr&ouml;&szlig;e wieder her.<br />
&nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp; Eine Anwendung sollte dieses Flag angeben, wenn es ein Fenster wiederherstellen will.<br />
&nbsp;&nbsp;&nbsp; @SW_SHOW - Aktiviert das Fenster und zeigt es in seiner aktuellen Gr&ouml;&szlig;e und Position.<br />
&nbsp;&nbsp;&nbsp; @SW_SHOWMAXIMIZED - Aktiviert das Fenster und zeigt es maximiert an.<br />
&nbsp;&nbsp;&nbsp; @SW_SHOWMINIMIZED - Aktiviert das Fenster und zeigt es minimiert an.<br />
&nbsp;&nbsp;&nbsp; @SW_SHOWMINNOACTIVE - Zeigt das Fenster minimiert an.<br />
&nbsp;&nbsp;&nbsp;   Dieser Wert ist gleichbedeutend mit @SW_SHOWMINIMIZED au&szlig;er, dass dieses Fenster nicht aktiviert ist.<br />
&nbsp;&nbsp;&nbsp; @SW_SHOWNA - Zeigt das Fenster in seiner aktuellen Gr&ouml;&szlig;e und Position an.<br />
&nbsp;&nbsp;&nbsp;   Dieser Wert ist gleichbedeutend mit @SW_SHOW au&szlig;er, dass dieses Fenster nicht aktiviert ist.<br />
&nbsp;&nbsp;&nbsp; @SW_SHOWNOACTIVATE - Zeigt ein Fenster in seiner zuletzt angezeigten Gr&ouml;&szlig;e und Position an.<br />
&nbsp;&nbsp;&nbsp;   Dieser Wert ist gleichbedeutend mit @SW_SHOWNORMAL au&szlig;er, dass dieses Fenster nicht aktiviert ist.<br />
&nbsp;&nbsp;&nbsp; @SW_SHOWNORMAL - Aktiviert und zeigt ein Fenster an.<br />
&nbsp;&nbsp;&nbsp;   Ist das Fenster minimiert oder maximiert, stellt das System seine urspr&uuml;gliche Gr&ouml;&szlig;e wieder her.<br />
&nbsp;&nbsp;&nbsp;   Eine Anwendung sollte dieses Flag angeben, wenn das Fenster das erste Mal angezeigt wird.</td>
</tr>
<tr>
<td>ptMinPosition</td>
<td>Bestimmt die Koordinaten der oberen linken Ecke des Fensters, wenn das Fenster minimiert ist.</td>
</tr>
<tr>
<td>ptMaxPosition</td>
<td>Bestimmt die Koordinaten der oberen linken Ecke des Fensters, wenn das Fenster maximiert ist.</td>
</tr>
<tr>
<td>rcNormalPosition</td>
<td>Bestimmt die Koordinaten des Fensters, wenn das Fenster an seiner wiederhergestellten Position ist.</td>
</tr>
</table>

</body>
</html>
