<!DOCTYPE html>
<html>
<head>
<title>Schl&uuml;sselwort $tagTVITEMEX</title>
<meta charset="utf-8">
<link href="../css/default.css" rel="stylesheet">
</head>

<body>
<h1 class="small">Schl&uuml;sselwortreferenz</h1>
<hr style="height:0px">
<div class="top"><h1>$tagTVITEMEX</h1><div>
<div id="flagtext">Beschreibung anzeigen in</div>
<div id="flaglink"> <a href="../libfunctions_en/$tagTVITEMEX.htm"><img src="../images/Flagge_en.png" height="29" width="36" border=0 hspace=10/></a></div>
<br style="clear: both;">
<p style="margin:2px 0 0 0;" class="funcdesc">Bestimmt oder empf&auml;ngt die Attribute eines Treeview Elements<br /></p>
<p class="codeheader">
Global Const $tagTVITEMEX = "struct; uint Mask;struct; handle hItem;uint State;uint StateMask;ptr Text;int TextMax;int Image;int SelectedImage;int Children;lparam Param; endstruct;" & _<br />
	"int Integral;uint uStateEx;hwnd hwnd;int iExpandedImage;int iReserved; endstruct"<br />
</p>

<h2>Parameter</h2>
<table>
<tr>
<td style="width:15%">Mask</td>
<td style="width:85%">Flags die angeben, welche der anderen Strukturmitglieder g&uuml;ltige Daten enthalten:<br />
&nbsp;&nbsp;&nbsp; $TVIF_CHILDREN - Das <strong>Children</strong> Mitglied ist g&uuml;ltig<br />
&nbsp;&nbsp;&nbsp; $TVIF_DI_SETITEM - Dies wird die mitgelieferten Informationen behalten und sie nicht wieder anfordern<br />
&nbsp;&nbsp;&nbsp; $TVIF_EXPANDEDIMAGE - Das iExpandedImage Mitglied ist g&uuml;ltig (IE Version 6.00 und Windows Vista)<br />
&nbsp;&nbsp;&nbsp; $TVIF_HANDLE - Das <strong>hItem</strong> Mitglied ist g&uuml;ltig<br />
&nbsp;&nbsp;&nbsp; $TVIF_IMAGE - Das <strong>Image</strong> Mitglied ist g&uuml;ltig<br />
&nbsp;&nbsp;&nbsp; $TVIF_INTEGRAL - Das <strong>Integral</strong> Mitglied ist g&uuml;ltig<br />
&nbsp;&nbsp;&nbsp; $TVIF_PARAM - Das <strong>Param</strong> Mitglied ist g&uuml;ltig<br />
&nbsp;&nbsp;&nbsp; $TVIF_SELECTEDIMAGE - Das <strong>SelectedImage</strong> Mitglied ist g&uuml;ltig<br />
&nbsp;&nbsp;&nbsp; $TVIF_STATE - Die <strong>State</strong> und <strong>StateMask</strong> Mitglieder sind g&uuml;ltig<br />
&nbsp;&nbsp;&nbsp; $TVIF_STATEEX - Das uStateEx Mitglied ist g&uuml;ltig (IE Version 6.00 und Windows Vista) <br />
&nbsp;&nbsp;&nbsp; $TVIF_TEXT - Die <strong>Text</strong> und <strong>TextMax</strong> Mitglieder sind g&uuml;ltig</td>
</tr>
<tr>
<td>hItem</td>
<td>Element auf welches sich diese Struktur bezieht</td>
</tr>
<tr>
<td>State</td>
<td>Satz von Bitflags und Imagelisten-Indizes, die den Zustand des Elements andeuten. <br />
Wenn der Zustand eines Elements gesetzt wird, legt das <strong>StateMask</strong> Mitglied fest, welche Bits dieses Mitgliedes g&uuml;ltig sind. <br />
Wenn der Zustand eines Elements ermittelt wird, gibt dieses Mitglied den aktuellen Zustand der in dem <strong>StateMask</strong> Mitglied angegebenen Bits zur&uuml;ck.<br />
Die Bits 0 bis 7 dieses Mitgliedes enthalten die Zustandsflags des Elements. Bits 8 bis 11 legen den eins-basierten Index des eingeblendeten Bildes fest.</td>
</tr>
<tr>
<td>StateMask</td>
<td>Bits des <strong>State</strong> Mitglieds, die g&uuml;ltig sind. <br />
Wenn der Zustand eines Elements ermittelt wird, m&uuml;ssen hier die Bits gesetzt werden, die man aus dem <strong>State</strong> Mitglied zur&uuml;ckgegeben haben m&ouml;chte.<br />
Wenn der Zustand eines Elements gesetzt wird, m&uuml;ssen hier die Bits gesetzt werden, die man in dem <strong>State</strong> Mitglied gesetzt haben m&ouml;chte.</td>
</tr>
<tr>
<td>Text</td>
<td>Zeiger auf einen null-terminierten String, die den Text des Elements enth&auml;lt.</td>
</tr>
<tr>
<td>TextMax</td>
<td>Gr&ouml;&szlig;e des Puffers, auf den das <strong>Text</strong> Mitglied verweist, in Zeichen</td>
</tr>
<tr>
<td>Image</td>
<td>Index des Icons in der Imagelist, das genutzt werden soll, wenn das Element im nicht-gew&auml;hlten Zustand ist</td>
</tr>
<tr>
<td>SelectedImage</td>
<td>Index des Icons in der Imagelist, das genutzt werden soll, wenn das Element im gew&auml;hlten Zustand ist</td>
</tr>
<tr>
<td>Children</td>
<td>Flag das angibt, ob das Element mit ihm verkn&uuml;pfte Child-Elemente hat. Dieses Mitglied kann einen der folgenden Werte haben:<br />
&nbsp;&nbsp;&nbsp; 0 - Das Element hat keine Child-Elemente<br />
&nbsp;&nbsp;&nbsp; 1 - Das Element hat ein oder mehr Child-Elemente</td>
</tr>
<tr>
<td>Param</td>
<td>Ein Wert, der mit dem Element verkn&uuml;pft werden kann.</td>
</tr>
<tr>
<td>Integral</td>
<td>H&ouml;he des Elements</td>
</tr>
<tr>
<td>uStateEx</td>
<td>Einer oder mehrere (als eine bitweise Kombination) der folgenden erweiterten Status.<br />
Bedeutung der Werte:<br />
TVIS_EX_DISABLED <strong>Windows Vista und neuer</strong>. Erstellt ein Control, welches grau gezeichnet wird, so dass der User dieses nicht bet&auml;tigen kann<br />
TVIS_EX_FLAT Erstellt ein flaches Items. Das Item ist virtuell und im Baum nicht sichtbar. Stattdessen nehmen dessen Kinder seinen Platz im der Baumhierarchie ein.<br />
TVIS_EX_HWND Erstellt ein separates HWND f&uuml;r das Item.</td>
</tr>
<tr>
<td>hwnd</td>
<td>Nicht verwendet; muss NULL sein.</td>
</tr>
<tr>
<td>iExpandedImage</td>
<td>Index des Bildes in der Bilderliste welches dargestellt werden soll, wenn das Item sich im erweiteren Status befindet.</td>
</tr>
<tr>
<td>iReserved</td>
<td>Reserviertes Mitglied. Nicht verwenden.</td>
</tr>
</table>

</body>
</html>
