<!DOCTYPE html>
<html>
<head>
<title>Schl&uuml;sselwort $tagREBARBANDINFO</title>
<meta charset="utf-8">
<link href="../css/default.css" rel="stylesheet">
</head>

<body>
<h1 class="small">Schl&uuml;sselwortreferenz</h1>
<hr style="height:0px">
<h1 style="float:left; margin:15px 0 0 0; padding:0 0 0 0;">$tagREBARBANDINFO</h1><br />
<a href="../libfunctions_en/$tagREBARBANDINFO.htm"><img src="../images/Flagge_en.gif" height="29" width="36" border=0 hspace=10 style="float:right"/></a><br />
<div style="display:block; text-align:right;">Beschreibung anzeigen in</div><br />
<p style="margin:2px 0 0 0;" class="funcdesc">Enth&auml;lt Informationen &uuml;ber ein Element in einem Rebar-Control<br /></p>
<p class="codeheader">
Global Const $tagREBARBANDINFO = "uint cbSize;uint fMask;uint fStyle;dword clrFore;dword clrBack;ptr lpText;uint cch;" & _<br />
		"int iImage;hwnd hwndChild;uint cxMinChild;uint cyMinChild;uint cx;handle hbmBack;uint wID;uint cyChild;uint cyMaxChild;" & _<br />
		"uint cyIntegral;uint cxIdeal;lparam lParam;uint cxHeader;" & $tagRECT & ";uint uChevronState"<br />
</p>

<h2>Parameter</h2>
<table>
<tr>
<td style="width:15%">cbSize</td>
<td style="width:85%">Gr&ouml;&szlig;e dieser Struktur, in Bytes. Die Anwendung muss dieses Mitglied ausf&uuml;llen, bevor irgendwelche Nachrichten gesendet werden, welche die Adresse dieser Struktur als Parameter verwenden.</td>
</tr>
<tr>
<td>fMask</td>
<td>Flags, die angeben welche Mitglieder dieser Struktur g&uuml;ltig sind und ausgef&uuml;llt werden m&uuml;ssen.<br />
Dieser Wert kann eine Kombination aus folgendendem sein:<br />
&nbsp;&nbsp;&nbsp; $RBBIM_BACKGROUND - Das <strong>hbmBack</strong> Mitglied ist g&uuml;ltig oder muss gesetzt werden.<br />
&nbsp;&nbsp;&nbsp; $RBBIM_CHILD - Das <strong>hwndChild</strong> Mitglied ist g&uuml;ltig oder muss gesetzt werden.<br />
&nbsp;&nbsp;&nbsp; $RBBIM_CHILDSIZE - Die <strong>cxMinChild</strong>, <strong>cyMinChild</strong>, <strong>cyChild</strong>, <strong>cyMaxChild</strong>, und <strong>cyIntegral</strong> Mitglieder sind g&uuml;ltig oder m&uuml;ssen gesetzt werden.<br />
&nbsp;&nbsp;&nbsp; $RBBIM_COLORS - Die <strong>clrFore</strong> und <strong>clrBack</strong> Mitglieder sind g&uuml;ltig oder m&uuml;ssen gesetzt werden.<br />
&nbsp;&nbsp;&nbsp; $RBBIM_HEADERSIZE - Version 4.71. Das <strong>cxHeader</strong> Mitglied ist g&uuml;ltig oder muss gesetzt werden.<br />
&nbsp;&nbsp;&nbsp; $RBBIM_IDEALSIZE - Version 4.71. Das <strong>cxIdeal</strong> Mitglied ist g&uuml;ltig oder muss gesetzt werden.<br />
&nbsp;&nbsp;&nbsp; $RBBIM_ID - Das <strong>wID</strong> Mitglied ist g&uuml;ltig oder muss gesetzt werden.<br />
&nbsp;&nbsp;&nbsp; $RBBIM_IMAGE - Das <strong>iImage</strong> Mitglied ist g&uuml;ltig oder muss gesetzt werden.<br />
&nbsp;&nbsp;&nbsp; $RBBIM_LPARAM - Version 4.71. Das <strong>lParam</strong> Mitglied ist g&uuml;ltig oder muss gesetzt werden.<br />
&nbsp;&nbsp;&nbsp; $RBBIM_SIZE - Das <strong>cx</strong> Mitglied ist g&uuml;ltig oder muss gesetzt werden.<br />
&nbsp;&nbsp;&nbsp; $RBBIM_STYLE - Das <strong>fStyle</strong> Mitglied ist g&uuml;ltig oder muss gesetzt werden.<br />
&nbsp;&nbsp;&nbsp; $RBBIM_TEXT - Das <strong>lpText</strong> Mitglied ist g&uuml;ltig oder muss gesetzt werden.<br />
&nbsp;&nbsp;&nbsp; $RBBIM_CHEVRONLOCATION - Das <strong>rcChevronLocation</strong> Mitglied ist g&uuml;ltig oder muss gesetzt werden.<br />
&nbsp;&nbsp;&nbsp; $RBBIM_CHEVRONSTATE - Das <strong>uChevronState</strong> Mitglied ist g&uuml;ltig oder muss gesetzt werden.</td>
</tr>
<tr>
<td>fStyle</td>
<td>Flags, die den Gruppenstil festlegen.<br />
Dieser Wert kann eine Kombination aus folgendendem sein:<br />
&nbsp;&nbsp;&nbsp; $RBBS_BREAK - Die Gruppe ist in einer neuen Zeile.<br />
&nbsp;&nbsp;&nbsp; $RBBS_CHILDEDGE - Die Gruppe hat, oben und unten des Child-Fensters, einen Rand.<br />
&nbsp;&nbsp;&nbsp; $RBBS_FIXEDBMP - Das Hintergrund-Bitmap bleibt unbeweglich, wenn die Gruppe seine Gr&ouml;&szlig;e &auml;ndert.<br />
&nbsp;&nbsp;&nbsp; $RBBS_FIXEDSIZE - Die Gr&ouml;&szlig;e Gruppe kann nicht ge&auml;ndert werden. Mit diesem Stil wird der "Griff" zur Gr&ouml;&szlig;enver&auml;nderung nicht angezeigt.<br />
&nbsp;&nbsp;&nbsp; $RBBS_GRIPPERALWAYS - Version 4.71. Die Gruppe hat immer einen "Griff" zur Gr&ouml;&szlig;enver&auml;nderung, auch wenn es die einzige Gruppe in der Rebar ist.<br />
&nbsp;&nbsp;&nbsp; $RBBS_HIDDEN - Die Gruppe ist nicht sichtbar.<br />
&nbsp;&nbsp;&nbsp; $RBBS_NOGRIPPER - Version 4.71. Die Gruppe hat niemals hat immer einen "Griff" zur Gr&ouml;&szlig;enver&auml;nderung, auch wenn mehr als eine Gruppe in der Rebar sind.<br />
&nbsp;&nbsp;&nbsp; $RBBS_USECHEVRON - Version 5.80. Zeigt einen Button mit zwei senkrechten Pfeilen an (Ausklapp-Button), wenn die Gruppe kleiner als <strong>cxIdeal</strong> ist.<br />
&nbsp;&nbsp;&nbsp; $RBBS_VARIABLEHEIGHT - Version 4.71. Die Gr&ouml;&szlig;e Gruppe kann von dem Rebar-Control angepasst werden; <strong>cyIntegral</strong> und <strong>cyMaxChild</strong> bestimmen wie die Rebar die Gr&ouml;&szlig;e anpassen.<br />
&nbsp;&nbsp;&nbsp; $RBBS_NOVERT - Nicht anzeigen, wenn vertikal.<br />
&nbsp;&nbsp;&nbsp; $RBBS_USECHEVRON - Ausklapp-Button anzeigen.<br />
&nbsp;&nbsp;&nbsp; $RBBS_HIDETITLE - Gruppentitel verstecken.<br />
&nbsp;&nbsp;&nbsp; $RBBS_TOPALIGN - Gruppe in der obersten Reihe behalten.</td>
</tr>
<tr>
<td>clrFore</td>
<td>Vordergrundfarben der Gruppe.</td>
</tr>
<tr>
<td>clrBack</td>
<td>Hintergrundfarben der Gruppe.<br />
&nbsp;&nbsp;&nbsp; Falls <strong>hbmBack</strong> eine Bitmap als Hintergrund festlegt, werden diese Mitglieder ignoriert.<br />
&nbsp;&nbsp;&nbsp; Standardm&auml;&szlig;ig benutzt die Gruppe die Hintergrundfarbe des Rebar-Controls die mit der $RB_SETBKCOLOR Nachricht gesetzt wurde.<br />
&nbsp;&nbsp;&nbsp; Falls die Hintergrundfarbe hier festgelegt wird, wird diese als Hintergrundfarbe benutzt.</td>
</tr>
<tr>
<td>lpText</td>
<td>Zeiger auf einen Puffer, der den Anzeigetext f&uuml;r die Gruppe enth&auml;lt.<br />
&nbsp;&nbsp;&nbsp; Wenn Gruppeninformationen von dem Control erfragt werden und $RBBIM_TEXT ist in <strong>fMask</strong> festgelegt, muss dieses Mitglied mit der Adresse des Puffers initialisiert werden, welcher den Text empf&auml;ngt.</td>
</tr>
<tr>
<td>cch</td>
<td>Gr&ouml;&szlig;e des Puffers in <strong>lpText</strong>, in Bytes. Falls keine Informationen von dem Control abgefragt werden, wird dieses Mitglied ignoriert.</td>
</tr>
<tr>
<td>iImage</td>
<td>0-basierter Index von irgendeinem Bild, das in der Gruppe angezeigt werden soll. Die Imagelist wird mit Hilfe der $RB_SETBARINFO Nachricht gesetzt.</td>
</tr>
<tr>
<td>hwndChild</td>
<td>Handle zu dem Child-Fenster, das in der Gruppe enthalten ist, sofern erw&uuml;nscht.</td>
</tr>
<tr>
<td>cxMinChild</td>
<td>Minimale Breite des Child-Fensters, in Pixel. Die Gr&ouml;&szlig;e der Gruppe kann nicht auf kleinere Werte als diesen ge&auml;ndert werden.</td>
</tr>
<tr>
<td>cyMinChild</td>
<td>Minimale H&ouml;he des Child-Fensters, in Pixel. Die Gr&ouml;&szlig;e der Gruppe kann nicht auf kleinere Werte als diesen ge&auml;ndert werden.</td>
</tr>
<tr>
<td>cx</td>
<td>L&auml;nge der Gruppe, in Pixel.</td>
</tr>
<tr>
<td>hbmBack</td>
<td>Handle zu einer Bitmap, die als Hintergrund dieser Gruppe genutzt wird.</td>
</tr>
<tr>
<td>wID</td>
<td>UINT Wert, den das Control nutzt, um diese Gruppe zu identifizieren, f&uuml;r benutzerdefinierte Zeichen-Nachrichten.</td>
</tr>
<tr>
<td>cyChild</td>
<td>Version 4.71. Ursprungsh&ouml;he der Gruppe, in Pixel. Dieses Mitglied wird ignoriert, es sei denn der Stil $RBBS_VARIABLEHEIGHT ist festgelegt.</td>
</tr>
<tr>
<td>cyMaxChild</td>
<td>Version 4.71. Maximale H&ouml;he des Bereichs in Pixel. Dieses Mitglied wird ignoriert, es sei denn der Stil $RBBS_VARIABLEHEIGHT ist festgelegt.</td>
</tr>
<tr>
<td>cyIntegral</td>
<td>Version 4.71. Schrittwert, um welchen die Gruppe wachsen oder schrumpfen kann, in Pixel.<br />
&nbsp;&nbsp;&nbsp; Falls die Gr&ouml;&szlig;e der Gruppe sich &auml;ndert, wird die Gr&ouml;&szlig;e schrittweise um diesen Wert ge&auml;ndert.<br />
&nbsp;&nbsp;&nbsp; Dieses Mitglied wird ignoriert, es sei denn der Stil $RBBS_VARIABLEHEIGHT ist festgelegt.</td>
</tr>
<tr>
<td>cxIdeal</td>
<td>Version 4.71. Ideale Breite der Gruppe, in Pixel.<br />
&nbsp;&nbsp;&nbsp; Falls die Gruppe auf die ideale Breite maximiert wird (siehe $RB_MAXIMIZEBAND), versucht das Rebar-Control die Gruppe auf diese Breite zu setzen.</td>
</tr>
<tr>
<td>lParam</td>
<td>Version 4.71. Anwendungsdefinierter Wert.</td>
</tr>
<tr>
<td>cxHeader</td>
<td>Version 4.71. Gr&ouml;&szlig;e des Kopfes der Gruppe, in Pixel.<br />
&nbsp;&nbsp;&nbsp; Der Kopf der Gruppe ist der Bereich zwischen dem Rand der Gruppe und dem Rand des Child-Fensters.<br />
&nbsp;&nbsp;&nbsp; Dies ist der Bereich in dem der Text der Gruppe und Bilder angezeigt werden, sofern sie bestimmt worden sind.<br />
&nbsp;&nbsp;&nbsp; Falls dieser Wert festgelegt ist, &uuml;berschreibt dieser die normalen Dimensionen des Kopfes, den das Control errechnet.</td>
</tr>
<tr>
<td>$tagRECT</td>
<td>Version 6. Lage des Chevron.</td>
</tr>
<tr>
<td>uChevronState</td>
<td>Version 6. Eine Kombination der Objektstatuskonstanten.</td>
</tr>
</table>

<h2>Verwandte Funktionen</h2>
<p><a href="$tagRECT.htm">$tagRECT</a></p>

</body>
</html>
