<!DOCTYPE html>
<html>
<head>
<title>Schl&uuml;sselwort $tagTEXTMETRIC</title>
<meta charset="utf-8">
<link href="../css/default.css" rel="stylesheet">
</head>

<body>
<h1 class="small">Schl&uuml;sselwortreferenz</h1>
<hr style="height:0px">
<div class="top"><h1>$tagTEXTMETRIC</h1><div>
<div id="flagtext">Beschreibung anzeigen in</div>
<div id="flaglink"> <a href="../libfunctions_en/$tagTEXTMETRIC.htm"><img src="../images/Flagge_en.png" height="29" width="36" border=0 hspace=10/></a></div>
<br style="clear: both;">
<p style="margin:2px 0 0 0;" class="funcdesc">Enth&auml;lt grundlegende Informationen zu einer physikalischen Schrift<br /></p>
<p class="codeheader">
Global Const $tagTEXTMETRIC = "long tmHeight;long tmAscent;long tmDescent;long tmInternalLeading;long tmExternalLeading;" & _<br />
	"long tmAveCharWidth;long tmMaxCharWidth;long tmWeight;long tmOverhang;long tmDigitizedAspectX;long tmDigitizedAspectY;" & _<br />
	"wchar tmFirstChar;wchar tmLastChar;wchar tmDefaultChar;wchar tmBreakChar;byte tmItalic;byte tmUnderlined;byte tmStruckOut;" & _<br />
	"byte tmPitchAndFamily;byte tmCharSet"<br />
</p>

<h2>Parameter</h2>
<table>
<tr>
<td style="width:15%">tmHeight</td>
<td style="width:85%">Definiert die H&ouml;he (Oberl&auml;nge + Unterl&auml;nge) der Zeichen.</td>
</tr>
<tr>
<td>tmAscent</td>
<td>Definiert die Oberl&auml;nge (Einheiten &uuml;ber der Grundlinie) der Zeichen.</td>
</tr>
<tr>
<td>tmDescent</td>
<td>Definiert die Unterl&auml;nge (Einheiten unter der Grundlinie) der Zeichen.</td>
</tr>
<tr>
<td>tmInternalLeading</td>
<td>Definiert den Durchschu&szlig; (Abstand) innerhalb des Bereichs der im Mitglied tmHeight gesetzt ist.<br />
Akzentzeichen und andere diakritikale Zeichen k&ouml;nnen in diesem Bereich vorkommen. Der Designer kann dieses Mitglied auf Null setzen.</td>
</tr>
<tr>
<td>tmExternalLeading</td>
<td>Definiert den Durchschu&szlig; (Abstand) den die Anwendung zwischen den Zeilen hinzuf&uuml;gt.<br />
Da dieser Bereich sich au&szlig;erhalb der Schrift befindet, enth&auml;lt er keine Zeichen und wird nicht durch Textausgabe-Aufrufe modifiziert, weder im Modus OPAQUE noch im Modus TRANSPARENT.<br />
Der Designer kann dieses Mitglied auf Null setzen.</td>
</tr>
<tr>
<td>tmAveCharWidth</td>
<td>Definiert die durchschnittliche Breite der Zeichen in der Schrift (&uuml;blicherweise festgelegt als die Breite des Buchstabens x).<br />
Dieser Wert enth&auml;lt nicht den erforderlichen &Uuml;berhang f&uuml;r fett oder kursiv geschriebene Zeichen.</td>
</tr>
<tr>
<td>tmMaxCharWidth</td>
<td>Definiert die Breite des breitesten Zeichens in der Schrift.</td>
</tr>
<tr>
<td>tmWeight</td>
<td>Definiert das Gewicht der Schrift.</td>
</tr>
<tr>
<td>tmOverhang</td>
<td>Definiert die zus&auml;tzliche Breite pro String die zu einigen synthetisierten Schriften hinzugef&uuml;gt werden kann.<br />
Beim Synthetisieren von einigen Zeichenattributen, wie bei Fett- oder Kursivschrift, muss die Grafische Ger&auml;teschnittstelle (GDI) oder ein Ger&auml;t m&ouml;glicherweise Abstand zu einem String hinzuf&uuml;gen, beiderseits, pro Zeichen und pro String.<br />
Zum Beispiel, GDI macht einen String in Fettschrift indem der Abstand von jedem Buchstaben ausgedehnt und mit einem Offset-Wert &uuml;berschrieben wird; es setzt eine Schrift auf kursiv indem der String abgeschr&auml;gt wird. In beiden F&auml;llen entsteht ein &Uuml;berhang nach dem grundlegenden String.<br />
F&uuml;r Strings in Fettschrift ist der &Uuml;berhang der Abstand des Versatzes mit dem ein Zeichen &uuml;berschrieben wird. F&uuml;r Strings in Kursivschrift ist der &Uuml;berhang die H&ouml;he um welche die Schrift nach unten abgeschr&auml;gt wurde.<br />
Das Mitglied tmOverhang erm&ouml;glicht es der Anwendung zu ermitteln, wie viel von der Zeichenbreite, die bei einem Aufruf der Funktion GetTextExtentPoint32 an einem einzelnen Buchstaben zur&uuml;ckgegeben wird, die aktuelle Zeichenbreite betr&auml;gt und wie viel die zus&auml;tzliche Pro-String-Breite betr&auml;gt.<br />
Die aktuelle Breite ist die Ausdehnung minus dem &Uuml;berhang.</td>
</tr>
<tr>
<td>tmDigitizedAspectX</td>
<td>Definiert den horizontalen Aspekt des Ger&auml;ts f&uuml;r das die Schrift entworfen wurde.</td>
</tr>
<tr>
<td>tmDigitizedAspectY</td>
<td>Definiert den vertikalen Aspekt des Ger&auml;ts f&uuml;r das die Schrift entworfen wurde.<br />
Das Verh&auml;ltnis der Mitglieder tmDigitizedAspectX und tmDigitizedAspectY ist das Verh&auml;ltnis des Aspekts des Ger&auml;ts f&uuml;r das die Schrift entworfen wurde.</td>
</tr>
<tr>
<td>tmFirstChar</td>
<td>Definiert den Wert des ersten Zeichens das in der Schrift definiert ist.</td>
</tr>
<tr>
<td>tmLastChar</td>
<td>Definiert den Wert des letzten Zeichens das in der Schrift definiert ist.</td>
</tr>
<tr>
<td>tmDefaultChar</td>
<td>Definiert den Wert des Zeichens, das f&uuml;r Zeichen die nicht in der Schrift sind ersetzt wird.</td>
</tr>
<tr>
<td>tmBreakChar</td>
<td>Definiert den Wert des Zeichens das f&uuml;r f&uuml;r Trennzeichen zwischen Worten benutzt wird.</td>
</tr>
<tr>
<td>tmItalic</td>
<td>Definiert eine kursive Schrift, wenn dieser Wert ungleich 0 ist.</td>
</tr>
<tr>
<td>tmUnderlined</td>
<td>Definiert eine unterstrichene Schrift, wenn dieser Wert ungleich 0 ist.</td>
</tr>
<tr>
<td>tmStruckOut</td>
<td>Definiert eine durchgestrichene Schrift, wenn dieser Wert ungleich 0 ist.</td>
</tr>
<tr>
<td>tmPitchAndFamily</td>
<td>&nbsp;&nbsp;&nbsp; Definiert Informationen &uuml;ber Abstand, Technik und Familie einer physikalischen Schrift.<br />
&nbsp;&nbsp;&nbsp; Die vier unteren Bits dieses Mitglieds definieren den Abstand und die Technik der Schrift. F&uuml;r jedes der vier Bits ist eine Konstante definiert.<br />
&nbsp;&nbsp;&nbsp; $TMPF_FIXED_FONT Wenn dieses Bit gesetzt ist, ist die Schrift mit variabler Breite. Wenn dieses Bit nicht gesetzt ist, ist die Schrift mit fester Breite. Zu beachten ist, das diese Bedeutungen das Gegenteil dessen sind, was der Konstantenname unterstellt.<br />
&nbsp;&nbsp;&nbsp; $TMPF_VECTOR Wenn dieses Bit gesetzt ist, ist die Schrift eine Vektor-Schrift.<br />
&nbsp;&nbsp;&nbsp; $TMPF_TRUETYPE Wenn dieses Bit gesetzt ist, ist es eine TrueType-Schrift.<br />
&nbsp;&nbsp;&nbsp; $TMPF_DEVICE Wenn dieses Bit gesetzt ist, ist es eine Ger&auml;teschrift.</td>
</tr>
<tr>
<td>tmCharSet</td>
<td>Definiert den Zeichensatz der Schrift. Der Zeichensatz kann einer der folgenden Werte sein.<br />
&nbsp;&nbsp;&nbsp; ANSI_CHARSET<br />
&nbsp;&nbsp;&nbsp; BALTIC_CHARSET<br />
&nbsp;&nbsp;&nbsp; CHINESEBIG5_CHARSET<br />
&nbsp;&nbsp;&nbsp; DEFAULT_CHARSET<br />
&nbsp;&nbsp;&nbsp; EASTEUROPE_CHARSET<br />
&nbsp;&nbsp;&nbsp; GB2312_CHARSET<br />
&nbsp;&nbsp;&nbsp; GREEK_CHARSET<br />
&nbsp;&nbsp;&nbsp; HANGUL_CHARSET<br />
&nbsp;&nbsp;&nbsp; MAC_CHARSET<br />
&nbsp;&nbsp;&nbsp; OEM_CHARSET<br />
&nbsp;&nbsp;&nbsp; RUSSIAN_CHARSET<br />
&nbsp;&nbsp;&nbsp; SHIFTJIS_CHARSET<br />
&nbsp;&nbsp;&nbsp; SYMBOL_CHARSET<br />
&nbsp;&nbsp;&nbsp; TURKISH_CHARSET<br />
&nbsp;&nbsp;&nbsp; VIETNAMESE_CHARSET</td>
</tr>
</table>

<h2>Bemerkungen</h2>
<p>Alle Gr&ouml;&szlig;en sind in logischen Einheiten angegeben, d.h., sie h&auml;ngen von dem aktuellen Koordinatensystem der Anzeige ab.<br />
</p>

</body>
</html>
